var array_one;
function selectLangArray(lang)
{
	switch(lang)
	{
        case "Marathi" :
            array_one = new Array(  

            'क'     ,  			    'k' ,										//	'kə' , 
            'ख' 	, 				'k-h',										//	'kʰə' , 
            'ग' 	,  				'g' ,										//	'gə' , 
            'घ' 	,  				'g-h',										//	'gʰə' , 
            'ङ' 	,  				'ńg',										//	'ŋə' , 
            'च' 	, 				'c' ,										//	'cə' , 
            'च़' 	 , 				 'č' ,										//	'cə' , 
            'छ' 	,  				'č-h',										//	'cʰə' , 
            'ज्ञ' 	  ,  			  'đ-n-y',									//	'gjə' , 
            'ज' 	, 				'j' ,										//	'ɟə' , 
            'ज़' 	 ,  			 'j',										//	'Ɉə' , 
            'झ' 	,  				'z' ,										//	'ɟʰə' , 
            'ञ' 	,  				'ń' ,										//	'ɲə' , 
            'ट' 	, 				't' ,										//	'ʈə' , 
            'ठ' 	,  				't-h',										//	'ʈʰə' , 
            'ड' 	, 				'd' ,										//	'ɖə' , 
            'ढ' 	, 				'd-h',										//	'ɖʰə' , 
            'ण' 	, 				'л' ,										//	'ɳə' , 
            'त' 	,  				'ŧ' ,										//	't̪ə' , 
            'थ' 	,  				'ŧ-h',										//	't̪ʰə' , 
            'द' 	,  				'đ' ,										//	'd̪ə' , 
            'ध' 	, 				'đ-h',										//	'd̪ʰə' , 
            'न' 	, 				'n' ,										// 	'nə' , 
            'प' 	,  				'p' ,										//	'pə' , 
            'फ'     , 			    'p-h',										//	'pʰə' , 
            'ब' 	,  				'b' ,										//	'bə' , 
            'भ' 	, 				'b-h',										//	'bʰə' , 
            'म' 	,  				'm' ,										//	'mə' , 
            'य' 	,  				'y' ,										//	'jə' , 
            'य़' 	,  				'y' ,										//	'jə' , 
            'र' 	,  				'r' ,										//	'rə' , 
            'ऱ' 	,  				'r' ,										//	'rə' , 
            'ल' 	, 			    'l' ,										//	'lə' , 
            'व' 	,  				'w' ,										//	'və' , 
            'श' 	,  			   's-h',										//	'ɕə' , 
            'ष' 	,  			   's-hø',										//	'ʂə' , 
            'स' 	,  			   's' ,										//	'sə' , 
            'ह' 	,  			   'h' ,										//	'ɦə' , 
            'क्ष' 	  ,  			 'k-s-h',									//	'kʃə' , 
            'त्र' 	  ,  		      'ŧ-r' ,										//	't̪ɾə' , 
           
            'श्र' 	  ,  			  's-h-r',									//	'ɕcə' , 
            'क़'     ,  		    'k',										//	'qə' , 
            'ख़' 	 ,  			'k-h',										//	'xə' , 
            'ग़' 	 ,  			'g' ,										//	'ɣə' , 
            'फ़'     ,  			'f' ,										//	'fə' , 
            'ड़' 	 ,  			'd' ,										//	'ɽə' , 
            'ड़'	    ,  			   'd' ,										//	'ɽə' , 
            'ढ़' 	 ,  			'd-h',										//	'ɽʱə' , 
            'ढ़'	    ,  			   'd-h',										//	'ɽʱə' ,
            'ळ'	    ,  			   'φ' ,	
            
            '्'     ,  				'ø' ,						                // jodakshar ,                      
            'ø'     ,      		    '-' ,	
            '़'     ,      			'ņ' ,	                                   	//	nukta ,                    
            "ा"    ,    		   'ā' ,										//	'ɑː',     
            'ि'    ,     		   'e' ,										//	'i' , 
            "ी"    ,         	   'ee' ,										//	'iː' ,  
            'ु'     ,      		    'u' ,										//	'u' ,
            'ू'     ,     			'uu' ,										//	'uː' ,
            'ृ'     ,      			'-ru',									    //	'ɹ̩',        
            "े"     ,      			"λ" ,										//	'eː' , 
            "ै"     ,      			"Δ" ,										//	'aːi' ,
            "ो"    ,     		   'o' ,										//	'oː' , 
            "ौ"   ,     		   'å' ,										//	'aːu' ,
            'ं'    ,      		    'ń' ,								        // anusvar 	 ,
            'ँ'    ,      			'ń' ,								        //	chandrabindu,
            'ः'    ,      	       'aøh' ,								        //	aha avagraha character , 
            'ॉ'    ,      	       'ö' ,										//English ö sound
            'ॅ'    ,      	        '@' ,										// English @ sound
             
            //Marathi Numbers

            '१' ,      			'1' ,										 
            '२' ,      			'2' ,										   
            '३' ,      			'3' ,										 
            '४' ,      			'4' ,										  
            '५' ,      			'5' ,										 
            '६' ,      			'6' ,										 
            '७' ,      			'7' ,										  
            '८' ,      			'8' ,										 
            '९' ,      			'9' ,										  
            '१०' ,      		'10',										  
            

            
            'अ' 	,  		    'a' ,										//	'ə' , 
            'आ'    ,  	       'ā' ,										//	'ɑː' , 
            'इ' 	,  			'e' ,										//	'i' , 
            'ई' 	,  		    'ee' ,										//	'iː' , 
            'उ' 	,  			'u' ,										//	'u' , 
            'ऊ'     ,  		    'uu' ,										//	'uː' , 
            'ए' 	,  			'λ' ,										//	'eː' , 
            'ऐ' 	,  			'Δ' ,										//	'aːi' , 
            'ओ'    ,  		   'o' ,										//	'oː' , 
            'औ'    ,  		   'å' ,										//	'aːu' ,
            'ऑ'    ,           'ö' ,
            'अॅ '    ,          '@' ,				 

            'ऋ'     ,  		   'ru',										//	'ɹ̩' , 
            'ॠ'     ,  	       'ruu' ,										//	'ɹ̩ː' , 
            'ऌ' 	,  		    'lu' ,										//	'l̩' , 
            'ॡ' 	,  	    	'luu' ,										//	'l̩ː' , 

            'अं' 	 ,  		'ń' ,										//	'ⁿ' , 
            'अः'    ,  		    'aøhā' 	
        );
        break;
        
		case "Hindi" :
        array_one = new Array(  

            'क' 	,  				'k' ,										//	'kə' , 
            'ख' 	, 				'k-h' ,										//	'kʰə' , 
            'ग' 	,  				'g' ,										//	'gə' , 
            'घ' 	,  				'g-h' ,										//	'gʰə' , 
            'ङ' 	,  				'ńg' ,										//	'ŋə' ,
            'ज्ञ' 	,  				'g-y' ,										//	'gjə' ,  
            'च' 	, 				'c' ,										//	'cə' ,
            'च़' 	, 				'č' ,										//	'cə' ,  
            'छ' 	,  				'č-h' ,										//	'cʰə' , 
            'ज' 	, 				'j' ,										//	'ɟə' , 
            'झ' 	,  				'z' ,										//	'ɟʰə' , 
            'ञ' 	,  				'yń' ,										//	'ɲə' , 
            'ट' 	, 				't' ,										//	'ʈə' , 
            'ठ' 	,  				't-h' ,										//	'ʈʰə' , 
            'ड' 	, 				'd' ,										//	'ɖə' , 
            'ढ' 	, 				'd-h' ,										//	'ɖʰə' , 
            'ण' 	, 				'л' ,										//	'ɳə' , 
            'त' 	,  				'ŧ' ,										//	't̪ə' , 
            'थ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
            'द' 	,  				'đ' ,										//	'd̪ə' , 
            'ध' 	, 				'đ-h' ,										//	'd̪ʰə' , 
            'न' 	, 				'n' ,										// 	'nə' , 
            'प' 	,  				'p' ,										//	'pə' , 
            'फ' 	, 				'p-h' ,										//	'pʰə' , 
            'ब' 	,  				'b' ,										//	'bə' , 
            'भ' 	, 				'b-h' ,										//	'bʰə' , 
            'म' 	,  				'm' ,										//	'mə' , 
            'य' 	,  				'y' ,										//	'jə' , 
            'य़' 	,  				'y' ,										//	'jə' , 
            'र' 	,  				'r' ,										//	'rə' , 
            'ऱ' 	,  				'r' ,										//	'rə' , 
            'ल' 	, 				'l' ,										//	'lə' , 
            'व' 	,  				'w' ,										//	'və' , 
            'श' 	,  				's-h' ,										//	'ɕə' , 
            'ष' 	,  				's-h',										//	'ʂə' , 
            'स' 	,  				's' ,										//	'sə' , 
            'ह' 	,  				'h' ,										//	'ɦə' , 
            'क्ष' 	,  				'k-s-h' ,									//	'kʃə' , 
            'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
            
            'श्र' 	,  				's-h-r',									//	'ɕcə' , 
            'क़' 	,  				'kø' ,										//	'qə' , 
            'ख़' 	,  				'k-hø' ,									//	'xə' , 
            'ग़' 	,  				'gø' ,										//	'ɣə' ,
            'च़' 	, 				'č' ,										//	'cə' ,  
            'ज़' 	,  				'ɉ' ,										//	'zə' , 
            'फ़' 	,  				'f' ,										//	'fə' , 
            'ड़' 	,  				'dø' ,										//	'ɽə' , 
            'ढ़'   ,               'd-h',										//  unicode 2397
            'ढ़' 	,  				'd-h' ,										//	unicode 2338 + 2364 , 
            
            'प्र'	,  				'p-r' ,	
            'क्र'	,  				'k-r' ,	
            'व्र'	,  				'w-r' ,
            
            
            
            '्' ,  				'-' ,										//	jodakshar ,
            
            "ा",     			'ā' ,										//	'ɑː' ,     
            'ि' ,     			'e' ,										//	'i' , 
            "ी",     			'ee' ,										//	'iː' ,  
            'ु' ,      			'u' ,										//	'u' ,
            'ू'  ,     			'uu' ,										//	'uː' ,
            'ृ' ,      			'-re' ,										//	'ɹ̩' ,        
            "े",      			"λ" ,										//	'eː' , 
            "ै",      			"Δ" ,										//	'aːi' ,
            "ो",     			'o' ,										//	'oː' , 
            "ौ",     			'å' ,										//	'aːu' ,
            'ं' ,      			'ń' ,										//	anusvar ,
            'ँ' ,      			'ń' ,										//	chandrabindu ,
            
            'ः' ,      			'aha' ,	                                    //	'h' ,  	
            '़' ,      			'ņ' ,	                                   	// nukta ,
            'ॉ' ,      			'ö' , 
            'ॅ' ,      			'@' ,							 
              
            'ø' ,      		        '-' ,										          //Combine letter
            
            //Hindi numbers
            
             
            '१' ,      			'1' ,										 
            '२' ,      			'2' ,										   
            '३' ,      			'3' ,										 
            '४' ,      			'4' ,										  
            '५' ,      			'5' ,										 
            '६' ,      			'6' ,										 
            '७' ,      			'7' ,										  
            '८' ,      			'8' ,										 
            '९' ,      			'9' ,										  
            '१०' ,      			'10' ,										  
            
            
            
            
            'अ' 	,  				'a' ,										//	'ə' , 
            'आ' 	,  				'ā' ,										//	'ɑː' , 
            'इ' 	,  				'e' ,										//	'i' , 
            'ई' 	,  				'ee' ,										//	'iː' , 
            'उ' 	,  				'u' ,										//	'u' , 
            'ऊ' 	,  				'uu' ,										//	'uː' , 
            'ए' 	,  				'λ' ,										//	'eː' , 
            'ऐ' 	,  				'Δ' ,										//	'aːi' , 
            'ओ' 	,  				'o' ,										//	'oː' , 
            'औ' 	,  				'å' ,										//	'aːu' , 
            'ऑ'  ,               'ö' ,
            'अॅ '  ,               '@' ,	
                                 
            'ऋ' 	,  				're' ,										//	'ɹ̩' , 
            'ॠ' 	,  				'ree' ,										//	'ɹ̩ː' , 
            'ऌ' 	,  				'lu' ,										//	'l̩' , 
            'ॡ' 	,  				'luu' ,										//	'l̩ː' , 
                
            'अं' 	,  				'ń' ,										//	anusvar , 
            'अः' 	,  				'ahā' 										//	'h' 
            
            );
		break;
		case "Sanskrit" :
        array_one = new Array(  

            'क' 	,  				'k' ,										//	'kə' , 
            'ख' 	, 				'k-h' ,										//	'kʰə' , 
            'ग' 	,  				'g' ,										//	'gə' , 
            'घ' 	,  				'g-h' ,										//	'gʰə' , 
            'ङ' 	,  				'ŋg' ,										//	'ŋə' ,
            'ज्ञ' 	,  				'đ-n-y' ,										//	'gjə' ,  
            'च' 	, 				'c' ,										//	'cə' , 
            'च़' 	, 				'č' ,										//	'cə' , 
            'छ' 	,  				'č-h' ,										//	'cʰə' , 
            'ज' 	, 				'j' ,										//	'ɟə' , 
            'ज़' 	,  				'ɉ' ,										//	'zə' , 
            'झ' 	,  				'z' ,										//	'ɟʰə' , 
            'ञ' 	,  				'ŋ' ,										//	'ɲə' , 
            'ट' 	, 				't' ,										//	'ʈə' , 
            'ठ' 	,  				't-h' ,										//	'ʈʰə' , 
            'ड' 	, 				'd' ,										//	'ɖə' , 
            'ढ' 	, 				'd-h' ,										//	'ɖʰə' , 
            'ण' 	, 				'л' ,										//	'ɳə' , 
            'त' 	,  				'ŧ' ,										//	't̪ə' , 
            'थ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
            'द' 	,  				'đ' ,										//	'd̪ə' , 
            'ध' 	, 				'đ-h' ,										//	'd̪ʰə' , 
            'न' 	, 				'n' ,										// 	'nə' , 
            'प' 	,  				'p' ,										//	'pə' , 
            'फ' 	, 				'p-h' ,										//	'pʰə' , 
            'ब' 	,  				'b' ,										//	'bə' , 
            'भ' 	, 				'b-h' ,										//	'bʰə' , 
            'म' 	,  				'm' ,										//	'mə' , 
            'य' 	,  				'y' ,										//	'jə' , 
            'र' 	,  				'r' ,										//	'rə' , 
            'ऱ'   ,               'r',										//  're',2353
            'ल' 	, 				'l' ,										//	'lə' , 
            'व' 	,  				'w' ,										//	'və' , 
            'श' 	,  				's-h' ,										//	'ɕə' , 
            'ष' 	,  				's-h',										//	'ʂə' , 
            'स' 	,  				's' ,										//	'sə' , 
            'ह' 	,  				'h' ,										//	'ɦə' , 
            'क्ष' 	,  				'k-s-h' ,										//	'kʃə' , 
            'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
            'श्र' 	,  				's-h-r' ,										//	'ɕcə' , 
            'क़' 	,  				'k' ,										//	'qə' , 
            'ख़' 	,  				'k-h' ,										//	'xə' , 
            'ग़' 	,  				'g' ,										//	'ɣə' , 
            'ज़' 	,  				'ɉ' ,										//	'zə' , 
            'फ़' 	,  				'f' ,										//	'ɽə' , 
            'ड़'	,  				'd' ,										//	'ɽə' , 
            'ढ़' 	,  				'd-h' ,										//	'ɽʱə' , 
            'ढ़'	,  				'd-h' ,										//	'ɽʱə' ,
            'ळ'	,  				'φ' ,	
            
            '्' ,  				'ø' ,										//	''  ,     // halant
            
            'ø' ,      		    '-' ,										//Combine letter
            "ृ" ,			   'ru',										// ru as in prithvi
            "ा",     			'ā' ,										//	'ɑː' ,     
            'ि' ,     			'e' ,										//	'i' , 
            "ी",     			'ee' ,										//	'iː' ,  
            'ु' ,      			'u' ,										//	'u' ,
            'ू'  ,     			'uu' ,										//	'uː' ,
            'ृ' ,      			'u' ,										//	'ɹ̩' ,        
            "े",      			"λ" ,										//	'eː' , 
            "ै",      			"Δ" ,										//	'aːi' ,
            "ो",     			'o' ,										//	'oː' , 
            "ौ",     			'å' ,										//	'aːu' ,
            'ं'  ,      			'ń' ,								        // anusvar 	 ,
            'ँ'  ,      			'ń' ,								        //	chandrabindu,
            // 'ः'  ,      	  	  'ah' ,								        //	ah F character , 
            'ॉ'  ,      	  	  'ö' ,											//English ö sound
            'ॅ'  ,      	 	   '@' ,										// English @ sound
            
            //sanskrit Numbers 										 
            '१' ,      			'1' ,										 
            '२' ,      			'2' ,										   
            '३' ,      			'3' ,										 
            '४' ,      			'4' ,										  
            '५' ,      			'5' ,										 
            '६' ,      			'6' ,										 
            '७' ,      			'7' ,										  
            '८' ,      			'8' ,										 
            '९' ,      			'9' ,										  
            '१०' ,      			'10' ,										  
            
            'अ' 	,  				'a' ,										//	'ə' , 
            'आ' 	,  				'ā' ,										//	'ɑː' , 
            'इ' 	,  				'e' ,										//	'i' , 
            'ई' 	,  				'ee' ,										//	'iː' , 
            'उ' 	,  				'u' ,										//	'u' , 
            'ऊ' 	,  				'uu' ,										//	'uː' , 
            'ए' 	,  				'λ' ,										//	'eː' , 
            'ऐ' 	,  				'Δ' ,										//	'aːi' , 
            'ओ' 	,  				'o' ,										//	'oː' , 
            'औ' 	,  				'å' ,										//	'aːu' , 
                
            'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
            'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
            'ऌ' 	,  				'l' ,										//	'l̩' , 
            'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                
            'अं' 	,  				'am' ,										//	'ⁿ' , 
            'अः' 	,  				'ahā' 										//	'h' 
            
            );            
        break;
        case "Kannada(Alpha)" :
        array_one = new Array(  
    
            'ಕ' 	,  				'k' ,										//	'kə', 
            'ಖ' 	, 				'k-h' ,										//	'kʰə', 
            'ಗ' 	,  				'g' ,										//	'gə', 
            'ಘ' 	,  				'g-h' ,										//	'gʰə', 
            'ಙ' 	,  				'd' ,										//	'ŋə', 
            'ಚ' 	, 				'c' ,										//	'cə', 
            'ಛ' 	,  				'c-h' ,										//	'cʰə', 
            'ಜ' 	, 				'j' ,										//	'ɟə', 
            'ಝ' 	,  				'ɉ' ,										//	'ɟʰə, 
            'ಞ' 	,  				'nya' ,										//	'ɲə', 
            'ಟ' 	, 				't' ,										//	'ʈə', 
            'ಠ' 	,  				't-h' ,										//	'ʈʰə', 
            'ಡ' 	, 				'd' ,										//	'ɖə', 
            'ಢ' 	, 				'd-h' ,										//	'ɖʰə', 
            'ಣ' 	, 				'л' ,										//	'ɳə', 
            'ತ' 	,  				't' ,										//	't̪ə', 
            'ಥ' 	,  				't-h' ,										//	't̪ʰə', 
            'ದ' 	,  				'đ' ,										//	'd̪ə', 
            'ಧ' 	, 				'đ-h' ,										//	'd̪ʰə', 
            'ನ' 	, 				'n' ,										// 	'nə', 
            'ಪ' 	,  				'p' ,										//	'pə', 
            'ಫ' 	, 				'p-h' ,										//	'pʰə', 
            'ಬ' 	,  				'b' ,										//	'bə', 
            'ಭ' 	, 				'b-h' ,										//	'bʰə', 
            'ಮ' 	,  				'm' ,										//	'mə', 
            'ಯ' 	,  				'y' ,										//	'jə', 
            'ರ' 	,  				'r' ,										//	'rə', 
            'ಲ' 	, 				'l' ,										//	'lə', 
            'ವ'	,  				'w' ,										//	'və', 
            'ವ'	,  				'v' ,										//	'və',
            'ಶ' 	,  				's-h' ,										//	'ɕə', 
            'ಷ' 	,  				's-h',										//	'ʂə', 
            'ಸ' 	,  				's' ,										//	'sə', 
            'ಹ' 	,  				'h' ,										//	'ɦə', 
            'क्ष' 	,  				'k-s-h' ,									//	'kʃə' , 
            'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə', 
            'ज्ञ' 	,  				'd-n-y' ,									//	'gjə', 
            'श्र' 	,  				's-h-r' ,									//	'ɕcə', 
            'क़' 	,  				'k' ,										//	'qə' , 
            'ख़' 	,  				'k-h' ,										//	'xə' , 
            'ग़' 	,  				'g' ,										//	'ɣə' , 
            'ज़' 	,  				'ɉ' ,										//	'zə' , 
            'फ़' 	,  				'f' ,										//	'fə' , 
            'ड़' 	,  				'd' ,										//	'ɽə' , 
            'ड़'	,  				'd' ,										//	'ɽə' , 
            'ढ़' 	,  				'd-h' ,										//	'ɽʱə', 
            'ढ़'	,  				'd-h' ,										//	'ɽʱə',
            'ಳ'	,  				'φ' ,	
            
            <!-- special characters -->
            
            '್',  				'ø',										//	'' blank
            '़' ,      			'',	                                    	//	nukta
            'ø',      			'-',										//  Combine letter
            'ಾ',     			'ā',										//	'ɑː' ,     
            'ಿ',     				'e',										//	'i' , 
            'ೀ',     			'ee',										//	'iː' ,  
            'ು',      			'u',										//	'u' ,
            'ೂ',     			'uu',										//	'uː' ,
            'ृ',      			'u',										//	'ɹ̩' ,        
            'ೆ',      			'λ',										//	'eː' , 
            'ೇ',      			'λ',										//	'aːi' ,
            'ೈ',      			'Δ',										//	'aːi' ,
            'ೊ',     			'o',										//	'oː' , 
            'ೋ',     			'oo',										//	'oː' , 
            'ೌ',     			'å',										//	'aːu' ,
            'ं',      			'an',										//	'ⁿ' ,
            'ँ',      			'om',										//	'ⁿ' ,
            'ं',        			'an',										//	'ⁿ' ,
            'ಂ',        			'-m' ,										//	'ⁿ' ,
            'ಃ',      			'aha' ,										//	'h' , 
            'ೖ',        		    'Δ' ,										//	kannada ai length mark ,
            'ೕ',        		    'λ' ,										//	kannada length mark ,
            'ಏ',      			'ee' ,
            'ೃ',      			'r' ,
            
            
            // kannada Numbers
            
            '೦' ,      			'0' ,
            '೧' ,      			'1' ,
            '೨' ,      			'2' ,										   
            '೩' ,      			'3' ,										 
            '೪' ,      			'4' ,										  
            '೫' ,      			'5' ,										 
            '೬' ,      			'6' ,										 
            '೭' ,      			'7' ,										  
            '೮' ,      			'8' ,										 
            '೯' ,      			'9' ,										  
            '೧೦' ,      			'10' ,										  
            
            <!-- kannada vowels -->                                     
            
            'ಅ' 	,  				'a' ,										//	'ə' , 
            'ಆ' 	,  				'ā' ,										//	'ɑː' , 
            'ಇ' 	,  				'e' ,										//	'i' , 
            'ಈ' 	,  				'ee' ,										//	'iː' , 
            'ಉ' 	,  				'u' ,										//	'u' , 
            'ಊ' 	,  				'uu' ,										//	'uː' , 
            'ಎ' 	,  				'λ' ,										//	'eː' , 
            'ಐ' 	,  				'λ' ,										//	'aːi' , 
            'ಒ' 	,  				'o' ,										//	'oː' , 
            'ಔ' 	,  				'å' ,										//	'aːu' ,
            'ಏ ' 	,  				'λ' ,										//	'ə' ,  
                
            <!-- others letters -->	
            
            'ಋ' 	,  				'ru' ,										//	'ɹ̩' , 
            'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
            'ऌ' 	,  				'l' ,										//	'l̩' , 
            'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
            'ಅಂ' 	,  				'am' ,										//	'ⁿ' , 
            'ಅಃ' 	,  				'ahā' 	,									//	'h' 
            'ಓ' 	,  				'ö' 
            );
        break;
        case "Bengali(Beta)" :
        array_one = new Array(  

            // Bengali Vowels
            
                'অ' 	,  				'ö' ,					//	'kö' , 
                'আ' 	, 				'ā' ,					//	'kʰə' , 
                'ই' 	,  				'e' ,					//	'gə' , 
                'ঈ' 	,  				'ee' ,					//	'gʰə' , 
                'উ' 	,  				'u' ,					//	'ŋə' , 
                'ঊ' 	, 				'uu' ,					//	'cə' , 
                'ঋ' 	,  				'Δ' ,					//	'cʰə' , 
                'এ' 	, 				'λ' ,					//	'ɟə' , 
                'ঐ' 	,  				'Δ' ,					//	'ɟʰə' , 
                'ও' 	,  				'o' ,					//	'ɲə' ,   ছন্দপতন
                'ঔ' 	, 				'å' ,					//	'ʈə' , 
            
            // Bengali Consonants
                                                
            'ক' 	,  				'k' ,					//	'ʈʰə' ,   
            'খ' 	, 				'k-h' ,					//	'ɖə' , 
            'গ' 	, 				'g' ,					//	'ɖʰə' , 
            'ঘ' 	, 				'g-h' ,					//	'ɳə' , 
            'ঙ' 	,  				'n' ,					//	't̪ə' , 
            'চ' 	,  				'č' ,					//	't̪ʰə' , 
            'ছ' 	,  				'c-h' ,					//	'd̪ə' , 
            'জ' 	, 				'ɉ' ,					//	'd̪ʰə' , 
            'ঝ' 	, 				'j' ,					// 	'nə' , 
            'ঞ' 	,  				'n' ,					//	'pə' , 
            'ট' 	, 				't' ,					//	'pʰə' , 
            'ঠ' 	,  				't-h' ,					//	'bə' , 
            'ড' 	, 				'd' ,					//	'bʰə' , 
            'ঢ' 	,  				'd-h' ,					//	'mə' , 
            'ণ' 	,  				'л' ,					//	'jə' , 
            'ত' 	,  				'ŧ' ,					//	'rə' , 
            'থ' 	, 				'ŧ-h' ,					//	'lə' , 
            'দ' 	,  				'đ' ,					//	'və' , 
            'ধ' 	,  				'đ-h' ,					//	'ɕə' , 
            'ন' 	,  				'n',				    //	'ʂə' , 
            'প' 	,  				'p' ,					//	'sə' , 
            'ফ' 	,  				'f' ,					//	'ɦə' , 
            'ব' 	,  				'b' ,					//	'kʃə' , 
            'ভ' 	,  				'b-h' ,					//	't̪ɾə' , 
            'ম' 	,  				'm' ,					//	'gjə' , 
            'য' 	,  				'ya' ,					//	'ɕcə' , 
            'র' 	,  				'r' ,					//	'qə' , 
            'ল' 	,  				'l' ,					//	'xə' , 
            'শ' 	,  				's-h' ,					//	'ɣə' , 
            'ষ' 	,  				's-h' ,					//	'zə' , 
            'স' 	,  				's-h' ,					//	'fə' , 
            'হ' 	,  				'h' ,					//	'ɽə' , 
            'য়'	,  				'y' ,					//	'ɽə' , 
            'ড়' 	,  				'?' ,					//	'ɽʱə' , 
            'ঢ়'	,  				'?' ,					//	'ɽʱə' ,
             
            // Special Charachter
             
             
            'া' ,  				'ā' ,					//	''  ,     
            'ি' ,      			'e' ,	                //	nukta,
            'ী' ,      		    'ee' ,					//Combine letter,
            "ু",     			'u' ,					//	'ɑː' ,    
            'ূ' ,     			'uu' ,					//	'i' , 
            "ৃ",     			'ø-r' ,					//	'iː' ,  
            'ে' ,      			'λ' ,					//	'u' ,
            'ৈ'  ,     			'Δ' ,					//	'uː' ,
            'ো' ,      			'o' ,					//	'ɹ̩' ,        
            "ৌ",      			"å" ,					//	'eː' , 
            'া' ,  				'ā' ,					//	''  ,     
            'ং' ,  				'am' ,					//	''  , 
            '।'  ,				'.'  ,					// devanagari danda		 , 
            '্' ,  				'-' ,					//	bengali sign virama  ,  
            '়' ,  				'ņ' ,					//	bengali sign nukta  ,  
            'ৎ' ,  				'ø' ,					//	bengali letter khanda ta  ,
            'ঁ' ,  				'ņ' ,					//	bengali sign candrabindu,   e.g=পাঁচ     
            
            
            
            '০' ,  				'0' ,					//	bengali digit zero  ,
            '১' ,  				'1' ,					//	bengali digit one  ,
            '২' ,  				'2' ,					//	bengali digit two  ,
            '৩' ,  				'3' ,					//	bengali digit Three  ,
            '৪' ,  				'4' ,					//	bengali digit Four  ,
            '৫' ,  				'5' ,					//	bengali digit Five  ,
            '৬' ,  				'6' ,					//	bengali digit Six  ,
            '৭' ,  				'7' ,					//	bengali digit Seven  ,
            '৮' ,  				'8' ,					//	bengali digit Eight  ,
            '৯' ,  				'9' ,					//	bengali digit Nine  ,
            '১০' ,  				'10' 					//	bengali digit Ten  ,    
            );
            break;     
            case "Malayalam(Alpha)" :
             array_one = new Array(  
    
                // Malayalam Consonants
                'ക' 	,  				'k' ,										//	'a' , 
                'ഖ' 	, 				'k-h' ,										//	'a' , 
                'ഗ' 	,  				'g' ,										//	'aː' , 
                'ഘ' 	,  				'g-h' ,										//	'aː' , 
                'ങ' 	,  				'n' ,										//	'i' , 
                'ച' 	, 				'c-h' ,										//	'i' , 
                'ഛ' 	,  				'c-h' ,										//	'iː' , 
                'ഛ' 	, 				'j' ,										//	'iː' , 
                'ഝ' 	,  				'z' ,										//	'u' , 
                'ഞ' 	,  				'n' ,										//	'u' , 
                'ട' 	, 				't' ,										//	'ɯ' , 
                'ഠ' 	,  				'n-y' ,										//	'uː' , 
                'ഡ' 	, 				'd' ,										//	'uː' , 
                'ഢ' 	, 				'd-h' ,										//	'e' , 
                'ണ' , 				'л' ,										//	'e' , 
                'ത' 	,  				'ŧ' ,										//	'eː' , 
                'ഥ' 	,  				'ŧ-h' ,										//	'eː' , 
                'ദ' 	,  				'đ' ,										//	'aɪ̯' , 
                'ധ' , 				'd' ,										//	'aɪ̯' , 
                'ന' 	, 				'n' ,										// 	'o' , 
                'പ' ,  				'p' ,										//	'o' , 
                'ഫ' 	, 				'p-h' ,										//	'oː' , 
                'ബ' ,  				'b' ,										//	'oː' , 
                'ഭ' , 				'b-h' ,										//	'aʊ̯' , 
                'മ',  				'm' ,										//	'aʊ̯' ,
                
                'യ' ,  				'y' ,
                'ര' ,  				'r' ,
                'ല' ,  				'l' ,
                'വ' ,  				'w' ,
                'ശ' ,  				's-h' ,
                'ഷ' ,  				's-h' ,
                'സ' ,  				's' ,
                'ഹ' ,  				'h' ,
                'ള' ,  				'l' ,
                'ഴ' ,  				'l' ,
                'റ' ,  				'r' ,
                'ൠ' ,  				'r-r' ,
                
                
                'ൽ' ,  				'?' ,
                'ജ' ,  				'ja' ,       //	malayalam letter ja
                'ർ' ,  				'?' ,
                 
                //Malayalam Vowels
                
                'അ' 	,  				'a' ,										//	'k' , 
                'ആ' 	,  				'ā' ,										//	'k' , 
                'ഇ' 	, 				'e' ,										//	'h' , 
                'ഉ' 	,  				'u' ,										//	'ŋ' , 
                'ഓ' 	,  				'uu' ,										//	't͡ʃ' , 
                'ഈ' ,  				'?',										//	'd͡ʑ' , 
                'ഊ' 	,  				'u' ,										//	malayalam letter uu, 
                'ഋ' 	,  				'rø' ,										//	'ɲ' , 
                'ഌ' 	,  				'?' ,									    //		malayalam letter vocalic l, 
                'ഏ' 	,  				'?' ,										//	malayalam letter ee , 
                'ഐ' ,  				'λ' ,									    //	'ɽ' , 
                'ഒ' 	,  				'?' ,									    //		malayalam letter o,my be 'o' , 
                'ഔ' 	,  				'å'  ,		// ŧ, đ or ŧ-h 					//	'd̪' , 
                'ൠ' 	,  				'r-r' ,		// ŧ, đ or ŧ-h					//	'ð' , 
                'എ' 	,  				'e' ,
                'ൻ' 	,  				'?' ,										//		malayalam u+00d7b , 
                'ൾ' 	,  				'?' ,										//		malayalam u+00d7e ,  
                // Kana,matra velanti etc 
                
                'ാ' ,  				'a' ,
                'ി' ,  				'e' ,
                'ീ' ,  				'ee' ,
                'ു' ,  				'u' ,
                'ൂ' ,  				'uu' ,
                'ൃ' ,  				'?' ,
                'െ' ,  				'e' ,
                'േ' ,  				'ee' ,
                'ൈ' ,  				'Δ' ,
                'ൊ' ,  				'o' ,
                'ോ' ,  				'o' ,
                'ൌ' ,  				'å' , 
                '്' ,  				'ā' ,                               // malayalam sign virama
                'ം' ,  				'am' ,
                // Malayalam Numbers
                
                '൦' ,      			'0' ,
                '൧' ,      			'1' ,
                '൨' ,      			'2' ,										   
                '൩' ,      			'3' ,										 
                '൪' ,      			'4' ,										  
                '൫' ,      			'5' ,										 
                '൬' ,      			'6' ,										 
                '൭' ,      			'7' ,										  
                '൮' ,      			'8' ,										 
                '൯' ,      			'9' ,										  
                '൰' ,      			'10' 
                );            
            break; 
            case "Telugu(Alpha)" :
             array_one = new Array(  

                // Telgu Consonants
                'క' 	,  				'k' ,										//	'a' , 
                'చ' 	, 				'c' ,										//	'a' , 
                'ట' 	,  				't' ,										//	'aː' , 
                'త' 	,  				'ŧ' ,										//	'aː' , 
                'ప' 	,  				'p' ,										//	'i' , 
                'య' 	, 			    'yā' ,										//	'i' , 
                'శ' 	,  				's-h-a' ,										//	'iː' , 
                'ఖ' 	, 				'k-h' ,										//	'iː' , 
                'ఛ' 	,  				'č' ,										//	'u' , 
                'ఠ' 	,  				't-h' ,										//	'u' , 
                'థ' 	, 				'đ-h' ,										//	'ɯ' , 
                'ఫ' 	,  				'p-h' ,										//	'uː' , 
                'ర' 	, 				'r' ,										//	'uː' , 
                'ష' 	, 				's-h' ,										//	'e' , 
                'గ' , 				'g' ,										//	'e' , 
                'జ' 	,  				'j' ,										//	'eː' , 
                'డ' 	,  				'd' ,										//	'eː' , 
                'ద' 	,  				'đ' ,										//	'aɪ̯' , 
                'బ' , 				'b' ,										//	'aɪ̯' , 
                'ల' 	, 				'l' ,										// 	'o' , 
                'స' ,  				's' ,										//	'o' , 
                'ఘ' 	, 				'g-h' ,										//	'oː' , 
                'ఝ' ,  				'z' ,										//	'oː' , 
                'ఢ' , 				'd-h' ,										//	'aʊ̯' , 
                'ధ',  				'd' ,										//	'aʊ̯' ,
                
                'భ' ,  				'b-h' ,
                'వ' ,  				'v' ,
                'ఱ' ,  				'r' ,
                'ఙ' ,  				'ɉ' ,
                'ఞ' ,  				'g-n-ya' ,
                'ణ' ,  				'ŋ' ,
                'న' ,  				'n' ,
                'మ' ,  				'm' ,
                'ళ' ,  				'φ' ,
                'హ' ,  				'h' ,
                
                 
                
                //Telgu Vowels
                
                'అ' 	,  				'a' ,										//	'k' , 
                'ఇ' 	,  				'e' ,										//	'k' , 
                'ఉ' 	, 				'u' ,										//	'h' , 
                'ఋ' 	,  			    'ru' ,										//	'ŋ' , 
                'ఌ' 	,  				'lu' ,										//	't͡ʃ' , 
                'ఎ' 	,  				'λ',										//	'd͡ʑ' , 
                'ఐ' 	,  				'Δ' ,										//	's' , 
                'ఓ' 	,  				'o' ,										//	'ɲ' , 
                'అం' 	,  			    'ŋ',					       		    //	'ʈ' , 
                'ఆ' 	,  				'ā' ,										//	'ɖ' , 
                'ఈ' 	,  				'ee' ,									    //	'ɽ' , 
                'ఊ' 	,  				'ū' ,									    //	'ɳ' , 
                'ౠ' 	,  			'ruu' ,										//	't̪' , 
                'ౡ' 	,  			    'luu'  ,		// ŧ, đ or ŧ-h 								//	'd̪' , 
                'ఏ' 	,  				'āy' ,		// ŧ, đ or ŧ-h								//	'ð' , 
                'ఒ' 	,  				'o' ,										//	'n̪' , 
                'ఔ' 	,  				'å' ,										//	'p' , 
                'అః' 	,  			    'ahø' ,										//	'b' , 
                'ొ' ,  				'o' ,
                 
                
                // Kana,matra velanti etc 
                
                'ి' ,  				'Δ' ,
                'ా' ,  				'ā' ,
                'ీ' ,  				'ee' ,
                'ు' ,  				'u' ,
                'ో' ,  				'ö' ,
                'ే' ,  				'λ' ,
                'ూ' ,  				'oo' ,
                'ె' ,  				'λ' ,
                '్' ,  				'-' ,
                'ం' ,  				'ŋ' ,
                'ై' ,  				'Δ' ,
                'ె' ,  				'e' ,
                'ౖ' ,  				'Δ' ,
                'ృ' ,  				'ru' ,
                'ౌ' ,  				'å' ,
                
                
                
                // Telugu Numbers
                
                '౦' ,      			'0' ,
                '౧' ,      			'1' ,
                '౨' ,      			'2' ,										   
                '౩' ,      			'3' ,										 
                '౪' ,      			'4' ,										  
                '౫' ,      			'5' ,										 
                '౬' ,      			'6' ,										 
                '౭' ,      			'7' ,										  
                '౮' ,      			'8' ,										 
                '౯' ,      			'9' ,										  
                '౧౦' ,      	       '10'
                );
            break; 

            case "Konkani(Beta)" :
            array_one = new Array(  
	
                'क' 	,  				'k' ,										//	'kə' , 
                'ख' 	, 				'k-h' ,										//	'kʰə' , 
                'ग' 	,  				'g' ,										//	'gə' , 
                'घ' 	,  				'g-h' ,										//	'gʰə' , 
                'ङ' 	,  				'ŋg' ,										//	'ŋə' , 
                'च' 	, 				'c' ,										//	'cə' , 
                'च़' 	, 				'č' ,										//	'cə' , 
                'छ' 	,  				'č-h' ,										//	'cʰə' , 
                'झ' 	,  				'z' ,										//	'ɟʰə' , 
                'ञ' 	,  				'ŋ' ,										//	'ɲə' , 
                'ट' 	, 				't' ,										//	'ʈə' , 
                'ठ' 	,  				't-h' ,										//	'ʈʰə' , 
                'ड' 	, 				'd' ,										//	'ɖə' , 
                'ढ' 	, 				'd-h' ,										//	'ɖʰə' , 
                'ण' 	, 				'ŋ' ,										//	'ɳə' , 
                'त' 	,  				'ŧ' ,										//	't̪ə' , 
                'थ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
                'द' 	,  				'đ' ,										//	'd̪ə' , 
                'ध' 	, 				'đ-h' ,										//	'd̪ʰə' , 
                'न' 	, 				'n' ,										// 	'nə' , 
                'प' 	,  				'p' ,										//	'pə' , 
                'फ' 	, 				'p-h' ,										//	'pʰə' , 
                'ब' 	,  				'b' ,										//	'bə' , 
                'भ' 	, 				'b-h' ,										//	'bʰə' , 
                'म' 	,  				'm' ,										//	'mə' , 
                'य' 	,  				'y' ,										//	'jə' , 
                'र' 	,  				'r' ,										//	'rə' , 
                'ल' 	, 				'l' ,										//	'lə' , 
                'व' 	,  				'w' ,										//	'və' , 
                'श' 	,  				's-h' ,										//	'ɕə' , 
                'ष' 	,  				's-h',										//	'ʂə' , 
                'स' 	,  				's' ,										//	'sə' , 
                'ह' 	,  				'h' ,										//	'ɦə' , 
                'क्ष' 	,  				'k-s-h' ,										//	'kʃə' , 
                'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
                'श्र' 	,  				's-h-r' ,										//	'ɕcə' , 
                'क़' 	,  				'k' ,										//	'qə' , 
                'ख़' 	,  				'k-h' ,										//	'xə' , 
                'ग़' 	,  				'g' ,										//	'ɣə' , 
                'ज़' 	,  				'ɉ' ,										//	'zə' , 
                'ज्ञ' 	,  				'đ-n-y' ,										//	'gjə' , 
                'ज' 	, 				'j' ,										//	'ɟə' , 
                'फ़' 	,  				'f' ,										//	'fə' , 
                'ड़' 	,  				'd' ,										//	'ɽə' , 
                'ड़'	,  				'd' ,										//	'ɽə' , 
                'ढ़' 	,  				'd-h' ,										//	'ɽʱə' , 
                'ढ़'	,  				'd-h' ,										//	'ɽʱə' ,
                'ळ'	,  				'φ' ,	
                
                '्' ,  				'ø' ,										//	''  ,     // blank
                '़' ,      			'ņ' ,	                                   	//	nukta
                
                'ø' ,      		'-' ,										//Combine letter
                
                "ा",     			'ā' ,										//	'ɑː' ,     
                'ि' ,     			'e' ,										//	'i' , 
                "ी",     			'ee' ,										//	'iː' ,  
                'ु' ,      			'u' ,										//	'u' ,
                'ू'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                "े",      			"λ" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                "ो",     			'o' ,										//	'oː' , 
                "ौ",     			'å' ,										//	'aːu' ,
                'ं' ,      			'ń' ,										//	'ⁿ' ,
                'ँ' ,      			'ń' ,										//	'ⁿ' ,
                'ः' ,      			'ahø' ,										//	'h' , 
                'ॉ' ,      			'ö' ,
                'ॅ' ,      			'@' ,	
                
                
                //Marathi Numbers
                
                                                          
                '१' ,      			'1' ,										 
                '२' ,      			'2' ,										   
                '३' ,      			'3' ,										 
                '४' ,      			'4' ,										  
                '५' ,      			'5' ,										 
                '६' ,      			'6' ,										 
                '७' ,      			'7' ,										  
                '८' ,      			'8' ,										 
                '९' ,      			'9' ,										  
                '१०' ,      			'10' ,										  
        
                'अ' 	,  				'a' ,										//	'ə' , 
                'आ' 	,  				'ā' ,										//	'ɑː' , 
                'इ' 	,  				'e' ,										//	'i' , 
                'ई' 	,  				'ee' ,										//	'iː' , 
                'उ' 	,  				'u' ,										//	'u' , 
                'ऊ' 	,  				'uu' ,										//	'uː' , 
                'ए' 	,  				'λ' ,										//	'eː' , 
                'ऐ' 	,  				'Δ' ,										//	'aːi' , 
                'ओ' 	,  				'o' ,										//	'oː' , 
                'औ' 	,  				'å' ,										//	'aːu' , 
                    
                'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'lu' ,										//	'l̩' , 
                'ॡ' 	,  				'luu' ,										//	'l̩ː' , 
                    
                'अं' 	,  				'ń' ,										//	'ⁿ' , 
                'अः' 	,  				'aøhā' 										//	'h' 
                );
            break; 
            case "Chinese(Simplified)(Alpha)" :
            array_one = new Array(  

                // Tamil Vowels
                    '诶'		,		'a'	,										//	'a' , 
                    '伊'		,		'i'	,										//	'i' , 
                    '吾'		,		'u'	,										//	'u' , 
                    //Chinese Consonants
                    '诶'	,       'a'	,										//'a'
                    
                    '吧'	,       'ba'	,										//'ba'
                      '八'	,       'bā'	,										//'bā'
                    '爸'	,       'bā'	,										//'bā'
                    '百'	,       'bǎi'	,										//'bǎi'
                      '北'	,       'běi'	,										//'běi'
                     '不'	,       'bù'	,										//'bù - bú'
                    
                    '大'	,       'dài'	,										//'dà - dài'
                    '岛'	,       'dǎo'	,										//'dǎo',
                    '的'	,		'dí'		,										//'de - dí - dì'
                    '弟'	,		'dì'	,										//'dì'
                    '地'	,		'de'	,										//'dì - de
                    '东'	,       'dōng'  ,                                             //'dōng'
                    '都'	,       'dōu'	,										//'dōu - dū'
                    '对'	,       'duì'	,										//'duì'
                    '多'	,		'duō'	,										//'duō'
                    
                    '儿'	,       'ér'   ,                                      	//'ér'
                    '二'	,		'èr'		,										//'èr'
                    
                    '方'	,		'fāng',										//fāng
                    
                    '港'	,		'gǎng'	,										//gǎng
                    '哥'	,		'gē'	,										//gē and also it may be g-h
                    '个'	,		'gè'	,										//gè - ge and also it may be ga
                    '关'	,		'guān'	,										//'guān'
                    '贵'	,		'guì'	,										//'guì'
                    '国'	,		'guó'	,										//'guó'
                    '过'	,		'guò'	,										//'guò'
                    
                    '海'	,		'hǎi'	,										//'hǎi'
                    '好'	,		'hǎo'	,										//'hǎo - hào'
                    '很'	,		'hěn'	,										//'hěn'
                    '会'	,		'huì'	,										//'huì - kuài'
                    
                    '家'	,		'jiā'	,										//'jiā'
                    '见'	,		'jiàn'	,										//'jiàn'
                    '叫'	,		'jiào'	,										//jiào
                    '姐'	,		'jiě'	,										//jiě
                    '京'	,		'jīng'	,										//jīng
                    '九'	,		'jiǔ'	,										//jiǔ
                    
                    '可'	,		'kě'	,										//kě
                    
                    '老'	,		'lǎo'	,										//lǎo and also it may be mā
                    '李'	,		'lǐ'	,										//lǐ
                    '零'	,		'líng',										//líng
                    '六'	,		'liù'	,										//liù  and also it may be leo
                    
                    '吗'	,		'mǎ'	,										//ma - má - mǎ
                    '妈'	,		'mā'	,										//mā
                    '么'	,		'me'	,										//me - yāo
                    '没'	,		'méi'	,										//méi - mò
                    '美'	,		'měi'	,										//měi
                    '妹'	,		'mèi'	,										//mèi
                    '们'	,		'men'	,										//men
                    '名'	,		'míng'	,										//míng
                    '明'	,		'míng'	,										//míng
                    
                    '哪'	,		'nǎ'	,										//nǎ
                    '那'	,		'nèi'	,										//nà - nèi
                    '南'	,		'nán'	,										//nán
                    '你'	,		'nǐ'	,										//nǐ
                    '您'	,		'nín'	,										//nín
                    
                    '朋'	,		'péng'	,										//péng and also it may be p-haŋ-g
                    
                    '七'	,		'qī'	,										//qī and also it may be s-hee
                    '起'	,		'qǐ'	,										//qǐ
                    '千'	,		'qiān'	,										//qiān
                    '去'	,		'qù'	,										//qù
                    
                    '人'	,		'rén'	,										//rén
                    '认'	,		'rèn'	,										//rèn
                    '日'	,		'rì'	,										//rì
                    
                    '三'	,		'sān'	,										//sān
                    '上'	,		'shàng'	,										//shàng
                    '谁'	,		'shéi'	,										//shéi - shuí
                    '什'	,		'shén'	,										//shén - shí
                    '生'	,		'shēng'	,										//shēng
                    '师'	,		'shī'	,										//shī
                    '十'	,		'shí'	,										//shí
                    '识'	,		'shí'	,										//shí
                    '是'	,		'shì'	,										//shì
                    '四'	,		'sì'	,										//sì
                    
                    '他'	,		'tā'	,										//tā
                    '她'	,		'tā'	,										//tā
                    '台'	,		'tái'	,										//tái
                    '天'	,		'tiān'	,										//tiān
                    
                    '湾'	,		'wān'	,										//wān
                    '万'	,		'wàn'	,										//wàn
                    '王'	,		'wáng'	,										//wáng
                    '我'	,		'wǒ'	,										//wǒ
                    '五'	,		'wǔ'	,										//wǔ	
                    
                    '西'	,		'xī'	,									//xī
                    '息'	,		'xí'	,									//xí
                    '系'	,		'xì'	,									//xì - jì
                    '先'	,		'xiān'	,									//xiān
                    '香'	,		'xiāng'	,									//xiāng
                    '想'	,		'xiǎng'	,									//xiǎng
                    '小'	,		'xiǎo'	,									//xiǎo
                    '谢'	,		'xiè'	,									//xiè
                    '姓'	,		'xìng'	,									//xìng
                    '休'	,		'xiū'	,									//xiū
                    '学'	,		'xué'	,									//xué
                    
                    '也'	,		'yě'	,									//yě
                    '一'	,		'yī'	,									//yī
                    '亿'	,		'yì'	,									//yì
                    '英'	,		'yīng'	,									//yīng
                    '友'	,		'yǒu'	,									//yǒu
                    '月'	,		'yuè'	,									//yuè
                    
                    '再'	,		'zài'	,									//zài and also it may be jāy
                    '张'	,		'zhāng'	,									//zhāng and also it may be j-haŋ-g
                    '这'	,		'zhè'	,									//zhè
                    '中'	,		'zhōng'	,									//zhōng - zhòng
                    '叫'	,		'jiào'	,
                    '姓'	,		'xìng'	,
                    
                    '名字'	,		'míngzi'	,
                    '哪国人'	,		'nǎguórén'	,
                    '你'		,		'nǐ'		,
                    '我'		,		'wǒ'		,
                    '认识你很高兴'	,	'rènshì nǐ hěn gāoxìng'	,
                    '是'		,		'shì'	,
                    '美国'	,		'Měiguó'	,
                    '中国'	,		'Zhōngguó'	,
                    '忙'		,		'máng'		,
                    '累'		,		'lèi'		,
                    '好'		,		'hǎo'		,
                    '你们'	,		'nǐmen'		,
                    '学生'	,		'xuéshēng'	,
                    '老师'	,		'lǎoshī'	,
                    '再见'	,		'zàijiàn'	,
                    '日本'	,		'Rìběn'		,
                    '他'		,		'tā'		,
                    '要'		,		'yào'		,
                    '喜欢'	,		'xǐhuan'	,
                    '喝'		,		'hē'		,
                    '吃'		,		'chī'		,
                    '咖啡'	,		'kāfēi'		,
                    '菜'		,		'cài'		,
                    '茶'		,		'chá'		,
                    '口'		,		'kǒu'		,
                    '个'		,		'gè'		,
                    '爸爸'	,		'bàba'		,
                    '妈妈'	,		'māma'		,
                    '哥哥'	,		'gēge'		,
                    '姐姐'	,		'jiějie'	,
                    '弟弟'	,		'dìdi'		,
                    '妹妹'	,		'mèimei'	,
                    '家'		,		'jiā'		,
                    '和'		,		'hé'		,
                    '谁'		,		'shéi'		,
                    '狗'		,		'gǒu'		,
                    '好看'	,		'hǎokàn'	,
                    '书'		,		'shū'		,
                    '兄弟姐妹',		'xiōngdì jiěmèi',
                    '房子'	,		'fángzi'	,
                    '家人'	,		'jiārén'	,
                    '介绍'	,		'jièshào'	,
                    '漂亮'	,		'piàoliàng'	,
                    '张'		,		'zhāng'		,
                    '女儿'	,		'nǚér'		,
                    '猫'		,		'māo'		,
                    '照片'	,		'zhàopiàn'	,
                    '多'		,		'duō'		,
                    '两'		,		'liǎng'		,
                    '可爱'	,		'kěài'		,
                    '块'		,		'kuài'		,
                    '杯'		,		'bēi'		,
                    '瓶'		,		'píng'		,
                    '买'		,		'mǎi'		,
                    '钱'		,		'qián'		,
                    '东西'	,		'dōngxi'	,
                    '谢谢'	,		'xièxie'	,
                    '不客气'	,		'búkèqì'	,
                    '些'		,		'xiē'		,
                    '百'		,		'bǎi'		,
                    '一共'	,		'yígòng'	,
                    '今天'	,		'jīntiān'	,
                    '几点'	,		'jǐdiǎn'	,
                    '分'		,		'fēn'		,
                    '看'		,		'kàn'		,
                    '电影'	,		'diànyǐng'	,
                    '上网'	,		'shàngwǎng'	,
                    '现在'	,		'xiànzài'	,
                    '半'		,		'bàn'		,
                    '做'		,		'zuò'		,
                    '做饭'	,		'zuòfàn'	,
                    '吃饭'	,		'chīfàn'	,
                    '请问'	,		'qǐngwèn'	,
                    '饭馆'	,		'fànguǎn'	,
                    '服务员'	,		'fúwùyuán'	,
                    '杯子'	,		'bēizi'		,
                    '真'		,		'zhēn'		,
                    '点菜'	,		'diǎncài'	,
                    '好吃'	,		'hǎochī'	,
                    '水'		,		'shuǐ'		,
                    '少'		,		'shǎo'		,
                    '买单'	,		'mǎidān'	,
                    '昨天'	,		'zuótiān'	,
                    '明天'	,		'míngtiān'	,
                    '什么时候',		'shénme shíhou',
                    '上午'	,		'shàngwǔ'	,
                    '星期'	,		'xīngqī'	,
                    '起床'	,		'qǐchuáng'	,
                    '早饭'	,		'zǎofàn'	,
                    '睡觉'	,		'shuìjiào'	,
                    '上课'	,		'shàngkè'	,
                    '想'		,		'xiǎng'		,
                    '月'		,		'yuè'		,
                    '日'		,		'rì'		,
                    '下午'	,		'xiàwǔ'		,
                    '晚上'	,		'wǎnshàng'	,
                    '请'		,		'qǐng'		,
                    '来'		,		'lái'		,
                    '有空'	,		'yǒukòng'	,
                    '对不起'	,		'duìbùqǐ'	,
                    '没关系'	,		'méiguānxi'	,
                    '生日'	,		'shēngrì'	,
                    '打球'	,		'dǎqiú'		,
                    '篮球'	,		'lánqiú'	,
                    '球赛'	,		'qiúsài'	,
                    '逛街'	,		'guàngjiē'	,
                    '周末'	,		'zhōumò'	,
                    '早起'	,		'zǎoqǐ'		,
                    '觉得'	,		'juéde'		,
                    '好玩儿'	,		'hǎowáner'	,
                    '运动'	,		'yùndòng'	,
                    '电影院'	,		'diànyǐngyuàn',
                    '学习'	,		'xuéxí'		,
                    '酒吧'	,		'jiǔba'		,
                    '啤酒'	,		'píjiǔ'		,
                    '有意思'	,		'yǒuyìsi'	,
                    '无聊'	,		'wúliáo'	,
                    '麻烦'	,		'máfán'		,
                    '出门'	,		'chūmén'	,
                    '种'		,		'zhǒng'		,
                    '一起'	,		'yìqǐ'		,
                    '算了'	,		'suànle'	,
                    '下雨'	,		'xiàyǔ'		,
                    '外面'	,		'wàimiàn'	,
                    '没问题'	,		'méi wèntí'	,
                    '可是'	,		'kěshì'		,
                    '做菜'	,		'zuòcài'	,
                    '唱歌'	,		'chànggē'	,
                    '说'		,		'shuō'		,
                    '汉语'	,		'hànyǔ'		,
                    '英语'	,		'yīngyǔ'	,
                    '不错'	,		'búcuò'		,
                    '教'		,		'jiāo'		,
                    '写字'	,		'xiězì'		,
                    '快'		,		'kuài'		,
                    '功课'	,		'gōngkè'	,
                    '图书馆'	,		'túshūguǎn'	,
                    '中饭'	,		'zhōngfàn'	,
                    '晚饭'	,		'wǎnfàn'	,
                    '中午'	,		'zhōngwǔ'	,
                    '非常'	,		'fēicháng'	,
                    '题'		,		'tí'		,
                    '难'		,		'nán'		,
                    '新'		,		'xīn'		,
                    '旧'		,		'jiù'		,
                    '大'		,		'dà'		,
                    '支'		,		'zhī'		,
                    '商店'	,		'shāngdiàn'	,
                    '手机'	,		'shǒujī'	,
                    '看一看'	,		'kànyíkàn'	,
                    '万'		,		'wàn'		,
                    '千'		,		'qiān'		,
                    '能'		,		'néng'		,
                    '上面'	,		'shàngmiàn'	,
                    '下面'	,		'xiàmiàn'	,
                    '旁边'	,		'pángbiān'	,
                    '里面'	,		'lǐmiàn'	,
                    '大楼'	,		'dàlóu'		,
                    '海边'	,		'hǎibiān'	,
                    '住'		,		'zhù'		,
                    '知道'	,		'zhīdào'	,
                    '欢迎'	,		'huānyíng'	,
                    '玩儿'	,		'wánr'		,
                    '公共汽车',		'gōnggòng qìchē',
                    '自行车'	,		'zìxíngchē'	,
                    '走路'	,		'zǒulù'		,
                    '站'		,		'zhàn'		,
                    '椅子'	,		'yǐzi'		,
                    '休息'	,		'xiūxí'		,
                    '上班'	,		'shàngbān'	,
                    '坐'		,		'zuò'		,
                    '骑'		,		'qí'		,
                    '超市'	,		'chāoshì'	,
                    '件'		,		'jiàn'		,
                    '衣服'	,		'yīfú'		,
                    '对了'	,		'duìle'		,
                    '告诉'	,		'gàosù'		,
                    '鸡蛋'	,		'jīdàn'		,
                    '忘了'	,		'wàngle'	,
                    '牛奶'	,		'niúnǎi'	,
                    '怎么'	,		'zěnme'		,
                    '走'		,		'zǒu'		,
                    '前'		,		'qián'		,
                    '就'		,		'jiù'		,
                    '邮局'	,		'yóujú'		,
                    '认识'	,		'rènshì'	,
                    '路'		,		'lù'		,
                    '左拐'	,		'zuǒguǎi'	,
                    '右拐'	,		'yòuguǎi'	,
                    '从'		,		'cóng'		,
                    '到'		,		'dào'		,
                    '事情'	,		'shìqíng'	,
                    '得'		,		'děi'		,
                    '时间'	,		'shíjiān'	,
                    '怕'		,		'pà'		,
                    '担心'	,		'dānxīn'	,
                        
                    '考试'	,		'kǎoshì'	,
                    '今年'	,		'jīnnián'	,
                    '不好意思',		'bùhǎoyìsi'	,
                    '听音乐'	, 		'tīng yīnyuè',
                    '附近'	,		'fùjìn'		,
                    '照相'	,		'zhàoxiàng'	,
                    '博物馆'	,		'bówùguǎn'	,
                    '朋友'	,		'péngyǒu'	,
                    '天'		,		'tiān'		,
                    '等一会儿',		'děng yìhuǐr',
                    '地方'	,		'dìfāng'	,
                    '远'		,		'yuǎn'		,
                    '近'		,		'jìn'		,
                    '小时'	,		'xiǎoshí'	,
                    '山'		,		'shān'		,
                    '爬山'	,		'páshān'	,
                    '公司'	,		'gōngsī'	,
                    '分钟'	,		'fēnzhōng'	,
                    '要'		,		'yào'		,
                    '方便'	,		'fāngbiàn'	,
                    '车'		,		'chēpiào'	,
                    '出租车'	,		'chūzūchē'	,
                    '地铁'	,		'dìtiě'		,
                    '载'		,		'zài'		,
                    '汽车'	,		'qìchē'		,
                    '开'		,		'kāi'		,
                    '风景'	,		'fēngjǐng'	,
                    '便宜'	,		'piányí'	,
                    '等'		,		'děng'		,
                    '迟到'	,		'chídào'	,
                    '从不'	,		'cóng bù'	,
                    '约'		,		'yuē'		,
                    '上次'	,		'shàngcì'	,
                    '已经'	,		'yǐjīng'	,
                    '慢'		,		'màn'		,
                    '多久'	,		'duōjiǔ'	,
                    '练习'	,		'liànxí'	,
                    '说话'	,		'shuōhuà'	,
                    '为什么'	,		'wèishénme'	,
                    '有用'	,		'yǒuyòng'	,
                    '放假'	,		'fàngjià'	,
                    '因为'	,		'yīnwèi'	,
                    '所以'	,		'suǒyǐ'		,
                    '刚'		,		'gāng'		,
                    '看见'	,		'kànjiàn'	,
                    '以前'	,		'yǐqián'	,
                    '书法'	,		'shūfǎ'		,
                    '开始'	,		'kāishǐ'	,
                    '学校'	,		'xuéxiào'	,
                    '课'		,		'kè'		,
                    '可能'	,		'kěnéng'	,
                    '最近'	,		'zuìjìn'	,
                    '喂'		,		'wéi'		,
                    '开会'	,		'kāihuì'	,
                    '打电话'	,		'dǎdiànhuà'	,
                    '那'		,		'nà'		,
                    '桌子'	,		'zhuōzi'	,
                    '生日会'	,		'shēngrì huì',
                    '苹果派'	,		'píngguǒ pài',
                    '邀请'	,		'yāoqǐng'	,
                    '好久不见',		'hǎojiǔ bújiàn'	,
                    '给'		,		'gěi'		,
                    '礼物'	,		'lǐwù'		,
                    '蓝色'	,		'lánsè'		,
                    '饺子'	,		'jiǎozi'	,
                    '旅游'	,		'lǚyóu'		,
                    '经验'	,		'jīngyàn'	,
                    '次'		,		'cì'		,
                    '快乐'	,		'kuàile'	,
                    '最'		,		'zuì'		,
                    '有名'	,		'yǒumíng'	,
                    '飞机'	,		'fēijī'		,
                    '听说'	,		'tīngshuō'	,
                    '高兴'	,		'gāoxìng'	,
                    '旅馆'	,		'lǚguǎn'	,
                    '纪念品'	,		'jìniànpǐn'	,
                    '计划'	,		'jìhuà'		,
                    '习惯'	,		'xíguàn'	,
                    '去年'	,		'qùnián'	,
                    '回国'	,		'huíguó'	,
                    '打算'	,		'dǎsuàn'	,
                    '北京'	,		'běijīng'	,
                    '外国'	,		'wàiguó'	,
                    '只'		,		'zhǐ'		,
                    '后天'	,		'hòutiān'	,
                    '女朋友'	,		'nǚpéngyou'	,
                    '走'		,		'zǒu'		,
                    '舍不得'	,		'shěbude'	,
                    '同学'	,		'tóngxué'	,
                    '想'		,		'xiǎng'		,
                    '写信'	,		'xiě xìn'	,
                    '搭'		,		'dā'		,
                    '回来'	,		'huílái'	,
                    '天气'	,		'tiānqì'	,
                    '冷'		,		'lěng'		,
                    '热'		,		'rè'		,
                    '滑雪'	,		'huáxuě'	,
                    '游泳'	,		'yóuyǒng'	,
                    '下雪'	,		'xiàxuě'	,
                    '舒服'	,		'shūfu'		,
                    '岁'		,		'suì'		,
                    '高'		,		'gāo'		,
                    '那么'	,		'nàme'		,
                    '胖'		,		'pàng'		,
                    '矮'		,		'ǎi'		,
                    '瘦'		,		'shòu'		,
                    '长'		,		'cháng'		,
                    '头发'	,		'tóufà'		,
                    '医生'	,		'yīshēng'	,
                    '生病'	,		'shēngbìng'	,
                    '看病'	,		'kànbìng'	,
                    '药'		,		'yào'		,
                    '身体'	,		'shēntǐ'	,
                    '水果'	,		'shuǐguǒ'	,
                    '蔬菜'	,		'shūcài'	,
                    '医院'	,		'yīyuàn'	,
                    '请假'	,		'qǐngjià'	,
                    '一'		,		'yī'		,
                    '一点儿'	,		'yìdiǎnr'	,
                    '七'		,		'qī'		,
                    '三'		,		'sān'		,
                    '上'		,		'shàng'		,
                    '下'		,		'xià'		,
                    '不'		,		'bù'		,
                    '九'		,		'jiǔ'		,
                    '了'		,		'le'		,
                    '二'		,		'èr'		,
                    '五'		,		'wǔ'		,
                    '人'		,		'rén'		,
                    '什么'	,		'shénme'	,
                    '会'		,		'huì'		,
                    '儿子'	,		'érzi'		,
                    '八'		,		'bā'		,
                    '六'		,		'liù'		,
                    '写'		,		'xiě'		,
                    '几'		,		'jǐ'		,
                    '前面'	,		'qiánmiàn'	,
                    '十'		,		'shí'		,
                    '去'		,		'qù'		,
                    '号'		,		'hào'		,
                    '后面'	,		'hòumiàn'	,
                    '吗'		,		'ma'		,
                    '听'		,		'tīng'		,
                    '呢'		,		'ne'		,
                    '哪'		,		'nǎ'		,
                    '哪儿'	,		'nǎer'		,
                    '四'		,		'sì'		,
                    '回'		,		'huí'		,
                    '在'		,		'zài'		,
                    '多少'	,		'duōshǎo'	,
                    '太'		,		'tài'		,
                    '她'		,		'tā'		,
                    '字'		,		'zì'		,
                    '小'		,		'xiǎo'		,
                    '小姐'	,		'xiǎojiě'	,
                    '工作'	,		'gōngzuò'	,
                    '年'		,		'nián'		,
                    '很'		,		'hěn'		,
                    '怎么样'	,		'zěnmeyàng'	,
                    '我们'	,		'wǒmen'		,
                    '时候'	,		'shíhòu'	,
                    '有'		,		'yǒu'		,
                    '本'		,		'běn'		,
                    '没有'	,		'méiyǒu'	,
                    '点'		,		'diǎn'		,
                    '电视'	,		'diànshì'	,
                    '的'		,		'de'		,
                    '米饭'	,		'mǐfàn'		,
                    '苹果'	,		'píngguǒ'	,
                    '读'		,		'dú'		,
                    '这'		,		'zhè'		,
                    '都'		,		'dōu'		,
                    '里'		,		'lǐ'		,
                    '饭店'	,		'fàndiàn'	,
                    '字'		,		'zì'										//zì and also it may be c-ha
            );
            break; 
            case "Sindhi(Future)" :
            array_one = new Array(  

                //  Sindhi Vowels
                
                'اَنۡ',  				'a-n' ,										  
                'اَو', 				'å' ,										 
                'او',  				'o' ,										 
                'اَي',  				'Δ' ,										 
                'اي',  				'e' ,										  
                'اُو' , 				'uu' ,										 
                'پيشُ',  			'u' ,										 
                'اِي' , 				'ee' ,										  
                'زير',  			'λ' ,										  
                'آ' ,  				'ā' ,										  
                'زبر', 				'a' ,										 
                
                // Sindhi Consonants
                
                'ڏ' ,  				'd' ,										//	'ʈʰə' , 
                'ڏ' , 				'đ-h' ,										//	'ɖə' , 
                'د' , 				'đ' ,										//	'ɖʰə' , 
                'خ' , 				'k-h' ,										//	'ɳə' , 
                'ح' ,  				'h' ,										//	't̪ə' , 
                'ڇ' ,  				'c-h' ,										//	't̪ʰə' , 
                'ڇ' ,  				'c' ,										//	'd̪ə' , 
                'ڃ' , 				'd-n-y' ,										//	'd̪ʰə' , 
                'جھ' , 				'z' ,										// 	'nə' , 
                'ڄ' ,  				'g-ya' ,										//	'pə' , 
                'ج' , 				'j' ,										//	'pʰə' , 
                ' پ' ,  			'p' ,										//	'bə' , 
                'ث' , 				's' ,										//	'bʰə' , 
                'ٺ' ,  				't-h' ,										//	'mə' , 
                'ٺ' ,  				't' ,										//	'jə' , 
                ' ٿ',  				'ŧ-h' ,										//	'rə' , 
                'ت' , 				'ŧ' ,										//	'lə' , 
                'ڀ' ,  				'b-h' ,										//	'və' , 
                'ٻ' ,  				'b' ,										//	'ɕə' , 
                'ب' ,  				'b',										//	'ʂə' , 
                'ا' ,  				'a' ,										//	'sə' , 
                
                '्' ,  				'-' ,										//	''  ,     // blank
                
                "ा",     			'ā' ,										//	'ɑː' ,     
                'ि' ,     			'e' ,										//	'i' , 
                "ी",     			'ee' ,										//	'iː' ,  
                'ु' ,      			'u' ,										//	'u' ,
                'ू'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                "े",      			"λ" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                "ो",     			'o' ,										//	'oː' , 
                "ौ",     			'å' ,										//	'aːu' ,
                'ं' ,      			'-n' ,										//	'ⁿ' ,
                'ँ' ,      			'om' ,										//	'ⁿ' ,
                'ं' ,        			'an' ,										//	'ⁿ' ,
                'ँ' ,        			'am' ,										//	'ⁿ' ,
                'ः' ,      			'aha' ,	                                                                        //	'h' ,
                '़' ,      			'' ,	                                   	                                //	nukta
                'ॉ' ,      			'ö' ,								 
                  
                'ø' ,      		        '-' ,										          //Combine letter
                
                //Sindhi numbers
                
                 
                '१' ,      			'1' ,										 
                '२' ,      			'2' ,										   
                '३' ,      			'3' ,										 
                '४' ,      			'4' ,										  
                '५' ,      			'5' ,										 
                '६' ,      			'6' ,										 
                '७' ,      			'7' ,										  
                '८' ,      			'8' ,										 
                '९' ,      			'9' ,										  
                '१०' ,      			'10' 									  
                );
            break; 

            case "French(Future)" :
            array_one = new Array(  

                // French Numbers
                '0',    '0',
                '1',    '1',
                '2',    '2',
                '3',    '3',
                '4',    '4',
                '5',    '5',
                '6',    '6',
                '7',    '7',
                '8',    '8',
                '9',    '9',
                '10',   '10'
                );
            break;
            
            case "Odia(Future)" :
            array_one = new Array(  
    
                // Odia Vowels
                
                'ଅ' 	,  				'a' ,										//	'kə' , 
                'ଆ' 	, 				'ā' ,										//	'kʰə' , 
                'ଇ' 	,  				'e' ,										//	'gə' , 
                'ଈ' 	,  				'ee' ,										//	'gʰə' , 
                'ଉ' 	,  				'u' ,										//	'ŋə' , 
                'ଊ' 	, 				'uu' ,										//	'cə' , 
                'ଋ' 	,  				'ru' ,										//	'cʰə' , 
                'ୠ' 	, 				'ru' ,										//	'ɟə' , 
                'ଌ' 	,  				'?' ,										//	'ɟʰə' , 
                'ୡ' 	,  				'?' ,										//	'ɲə' , 
                'ଏ' 	, 				'e' ,										//	'ʈə' , 
                'ଐ' 	,  				'Δ' ,										//	'ʈʰə' , 
                'ଓ' 	, 				'o' ,										//	'ɖə' , 
                'ଔ' 	, 				'å' ,										//	'ɖʰə' , 
                
                
                // Odia Consonants
                
                'କ' 	, 				'k' ,										//	'ɳə' , 
                'ଖ' 	,  				'k-h' ,										//	't̪ə' , 
                'ଗ' 	,  				'g' ,										//	't̪ʰə' , 
                'ଘ' 	,  				'g-h' ,										//	'd̪ə' , 
                'ଙ' 	, 				'n' ,										//	'd̪ʰə' , 
                'ଚ' 	, 				'c' ,										// 	'nə' , 
                'ଛ' 	,  				'c-h' ,										//	'pə' , 
                'ଜ' 	, 				'j' ,										//	'pʰə' , 
                'ଝ' 	,  				'z' ,										//	'bə' , 
                'ଞ' 	, 				'n' ,										//	'bʰə' , 
                'ଟ' 	,  				't' ,										//	'mə' , 
                'ଠ' 	,  				't' ,										//	'jə' , 
                'ଡ' 	,  				'd' ,										//	'rə' , 
                'ଢ' 	, 				'd-h' ,										//	'lə' , 
                'ଡ଼'	,  				'r' ,										//	'və' , 
                'ଢ଼'	,  				'r' ,										//	'və' ,
                'ଣ' 	,  				'л' ,										//	'ɕə' , 
                'ତ' 	,  				'ŧ',										//	'ʂə' , 
                'ଥ' 	,  				'ŧ-h' ,										//	'sə' , 
                'ଦ' 	,  				'đ' ,										//	'ɦə' , 
                'ଧ' 	,  				'đ-h' ,										//	'kʃə' , 
                'ନ' 	,  				'n' ,										//	't̪ɾə' , 
                'ପ' 	,  				'p' ,										//	'gjə' , 
                'ଫ' 	,  				'p-h' ,										//	'ɕcə' , 
                'ବ' 	,  				'b' ,										//	'qə' , 
                'ଵ' 	,  				'w' ,										//	'xə' , 
                'ଭ' 	,  				'b-h' ,										//	'ɣə' , 
                'ମ' 	,  				'm' ,										//	'zə' , 
                'ଯ' 	,  				'y' ,										//	'fə' , 
                'ୟ' 	,  				'y' ,										//	'ɽə' , 
                'ର'	,  				'r' ,										//	'ɽə' , 
                'ଲ' 	,  				'l' ,										//	'ɽʱə' , 
                'ଳ'	,  				'l' ,										//	'ɽʱə' ,
                'ୱ'	,  				'w' ,	
                'ଶ'	,  				's-h' ,										//	'ɽʱə' ,
                'ଷ'	,  				's-h' ,										//	'ɽʱə' ,
                'ସ'	,  				's' ,										//	'ɽʱə' ,
                'ହ'	,  				'h' ,										//	'ɽʱə' ,
                
                
                // Odia Numbers
                
                '୦' ,      			'0' ,
                '୧' ,      			'1' ,
                '୨' ,      			'2' ,										   
                '୩' ,      			'3' ,										 
                '୪' ,      			'4' ,										  
                '୫' ,      			'5' ,										 
                '୬' ,      			'6' ,										 
                '୭' ,      			'7' ,										  
                '୮' ,      			'8' ,										 
                '୯' ,      			'9' ,										   
                
                                                     
                // Special Characters
                
                
                'ଁ' 	,  				'?' ,										//	'ə' , 
                'ଂ ' 	,  				'?' ,										//	'ɑː' , 
                'ଃ' 	,  				'?' ,										//	'i' , 
                '଼' 	,  				'?' ,										//	'iː' , 
                'ଽ' 	,  				'?' ,										//	'u' , 
                'ା ' 	,  				'ā' ,										//	'uː' , 
                'ି' 	,  				'e' ,										//	'eː' , 
                'ୀ' 	,  				'ee' ,										//	'aːi' , 
                'ୁ' 	,  				'u' ,										//	'oː' , 
                'ୂ' 	,  				'uu' ,										//	'aːu' ,
                'ୃ' 	,  				'w-r' ,										//	'ə' ,  
                'େ' 	,  				'e' ,										//	'ɹ̩' , 
                'ୈ' 	,  				'Δ' ,										//	'ɹ̩ː' , 
                'ୋ' 	,  				'o' ,										//	'l̩' , 
                'ୌ' 	,  				'å' ,										//	'l̩ː' , 
                    
                '୍' 	,  				'?' ,										//	'ⁿ' , 
                'ୖ' 	,  				'?' 	,									//	'h' 
                'ୗ' 	,  				'å' 
                );
            break; 
            case "Assamese(Future)" :
            array_one = new Array(  

                // Bengali Vowels
                
                'অ' 	,  				'a' ,					//	'kö' , 
                'আ' 	, 				'ā' ,					//	'kʰə' , 
                'ই' 	,  				'e' ,					//	'gə' , 
                'ঈ' 	,  				'ee' ,					//	'gʰə' , 
                'উ' 	,  				'u' ,					//	'ŋə' , 
                'ঊ' 	, 				'uu' ,					//	'cə' , 
                'ঋ' 	,  				'r-r' ,					//	'cʰə' , 
                'এ' 	, 				'λ' ,					//	'ɟə' , 
                'ঐ' 	,  				'Δ' ,					//	'ɟʰə' , 
                'ঔ' 	,  				'å' ,					//	'ɲə' ,   ছন্দপতন
                'ও' 	, 				'o' ,					//	'ʈə' , 
                
                // Bengali Consonants
                                                    
                'ক' 	,  				'k' ,					//	'ʈʰə' ,   
                'খ' 	, 				'k-h' ,					//	'ɖə' , 
                'গ' 	, 				'g' ,					//	'ɖʰə' , 
                'ঘ' 	, 				'g-h' ,					//	'ɳə' , 
                'ঙ' 	,  				'n' ,					//	't̪ə' , 
                'চ' 	,  				'č' ,					//	't̪ʰə' , 
                'ছ' 	,  				'c-h' ,					//	'd̪ə' , 
                'জ' 	, 				'ɉ' ,					//	'd̪ʰə' , 
                'ঝ' 	, 				'j' ,					// 	'nə' , 
                'ঞ' 	,  				'n' ,					//	'pə' , 
                'ট' 	, 				't' ,					//	'pʰə' , 
                'ঠ' 	,  				't-h' ,					//	'bə' , 
                'ড' 	, 				'd' ,					//	'bʰə' , 
                'ঢ' 	,  				'd-h' ,					//	'mə' , 
                'ণ' 	,  				'л' ,					//	'jə' , 
                'ত' 	,  				'ŧ' ,					//	'rə' , 
                'থ' 	, 				'ŧ-h' ,					//	'lə' , 
                'দ' 	,  				'đ' ,					//	'və' , 
                'ধ' 	,  				'đ-h' ,					//	'ɕə' , 
                'ন' 	,  				'n',				    //	'ʂə' , 
                'প' 	,  				'p' ,					//	'sə' , 
                'ফ' 	,  				'f' ,					//	'ɦə' , 
                'ব' 	,  				'b' ,					//	'kʃə' , 
                'ভ' 	,  				'b-h' ,					//	't̪ɾə' , 
                'ম' 	,  				'm' ,					//	'gjə' , 
                'য' 	,  				'ya' ,					//	'ɕcə' , 
                'র' 	,  				'r' ,					//	'qə' , 
                'ল' 	,  				'l' ,					//	'xə' , 
                'শ' 	,  				's-h' ,					//	'ɣə' , 
                'ষ' 	,  				's-h' ,					//	'zə' , 
                'স' 	,  				's-h' ,					//	'fə' , 
                'হ' 	,  				'h' ,					//	'ɽə' , 
                'য়'	,  				'y' ,					//	'ɽə' , 
                'ড়' 	,  				'?' ,					//	'ɽʱə' , 
                'ঢ়'	,  				'?' ,					//	'ɽʱə' ,
                 
                // Special Charachter
                 
                 
                'া' ,  				'ā' ,					//	''  ,     
                'ি' ,      			'e' ,	                //	nukta,
                'ী' ,      		    'ee' ,					//Combine letter,
                "ু",     			'u' ,					//	'ɑː' ,    
                'ূ' ,     			'uu' ,					//	'i' , 
                "ৃ",     			'ø-r' ,					//	'iː' ,  
                'ে' ,      			'λ' ,					//	'u' ,
                'ৈ'  ,     			'Δ' ,					//	'uː' ,
                'ো' ,      			'o' ,					//	'ɹ̩' ,        
                "ৌ",      			"å" ,					//	'eː' , 
                'া' ,  				'ā' ,					//	''  ,     
                'ং' ,  				'am' ,					//	''  , 
                '।'  ,				'.'  ,					// devanagari danda		 , 
                '্' ,  				'-' ,					//	bengali sign virama  ,  
                '়' ,  				'ņ' ,					//	bengali sign nukta  ,  
                'ৎ' ,  				'ø' ,					//	bengali letter khanda ta  ,
                'ঁ' ,  				'ņ' ,					//	bengali sign candrabindu,   e.g=পাঁচ     
                
                
                
                '০' ,  				'0' ,					//	bengali digit zero  ,
                '১' ,  				'1' ,					//	bengali digit one  ,
                '২' ,  				'2' ,					//	bengali digit two  ,
                '৩' ,  				'3' ,					//	bengali digit Three  ,
                '৪' ,  				'4' ,					//	bengali digit Four  ,
                '৫' ,  				'5' ,					//	bengali digit Five  ,
                '৬' ,  				'6' ,					//	bengali digit Six  ,
                '৭' ,  				'7' ,					//	bengali digit Seven  ,
                '৮' ,  				'8' ,					//	bengali digit Eight  ,
                '৯' ,  				'9' ,					//	bengali digit Nine  ,
                '১০' ,  				'10' 					//	bengali digit Ten  ,       
                );
            break; 
            case "Dogri(Future)" :
            array_one = new Array(  

                // Dogri Vowels
                
                'अ' 	,  				'a' ,										//	'kə' , 
                'आ' 	, 				'ā' ,										//	'kʰə' , 
                'इ' 	,  				'e' ,										//	'gə' , 
                'ई' 	,  				'ee' ,										//	'gʰə' , 
                'उ' 	,  				'u' ,										//	'ŋə' , 
                'ऊ' 	, 				'uu' ,										//	'cə' , 
                'ए' 	, 				'λ' ,										//	'cə' , 
                'ऐ ' 	,  				'Δ' ,										//	'cʰə' , 
                'ओ' 	, 				'o' ,										//	'ɟə' , 
                'औ' 	,  				'å' ,										//	'ɟʰə' , 
                
                //Dogri Consonants
                
                
                'क्' 	,  				'k' ,										//	'ɲə' , 
                'ख्' 	, 				'k-h' ,										//	'ʈə' , 
                'ग्' 	,  				'g' ,										//	'ʈʰə' , 
                'घ्' 	, 				'g-h' ,										//	'ɖə' , 
                'ङ्' 	, 				'd-n' ,										//	'ɖʰə' , 
                'च्' 	, 				'č' ,										//	'ɳə' , 
                'छ्' 	,  				'c-h' ,										//	't̪ə' , 
                'ज्' 	,  				'j' ,										//	't̪ʰə' , 
                'झ्' 	,  				'z' ,										//	'd̪ə' , 
                'ञ्' 	, 				'л' ,										//	'd̪ʰə' , 
                'ट्' 	, 				't' ,										// 	'nə' , 
                'ठ्' 	,  				't-h' ,										//	'pə' , 
                'ड्' 	, 				'd' ,										//	'pʰə' , 
                'ढ्' 	,  				'd-h' ,										//	'bə' , 
                'ण्' 	, 				'л' ,										//	'bʰə' , 
                'त्' 	,  				'ŧ' ,										//	'mə' , 
                'थ्' 	,  				'ŧ-h' ,										//	'jə' , 
                'द्' 	,  				'đ' ,										//	'rə' , 
                'ध्' 	, 				'đ-h' ,										//	'lə' , 
                'न्' 	,  				'n' ,										//	'və' , 
                'प्' 	,  				'p' ,										//	'ɕə' , 
                'फ्' 	,  				'f',										//	'ʂə' , 
                'ब्' 	,  				'b' ,										//	'sə' , 
                'भ्' 	,  				'b-h' ,										//	'ɦə' , 
                'म्' 	,  				'm' ,										//	'kʃə' , 
                'य्' 	,  				'y' ,										//	't̪ɾə' , 
                'र्' 	,  				'r' ,										//	'gjə' , 
                'ल्' 	,  				'l' ,										//	'ɕcə' , 
                'व्' 	,  				'w' ,										//	'qə' , 
                'श्' 	,  				's-h' ,										//	'xə' , 
                'स्' 	,  				's' ,										//	'ɣə' , 
                'ह्' 	,  				'h' ,										//	'zə' , 
                'क्ष्' 	,  				'k-s-h' ,										//	'zə' , 
                'त्र्' 	,  				'ŧ-r' ,										//	'zə' , 
                'ज्ञ्' 	,  				'd-n-y' ,										//	'fə' , 
                
                
                
                // Special Characters
                
                
                'ा' ,  				'ā' ,										//	''  ,     
                "ी",     			'ee' ,										//	'ɑː' ,     
                'ु' ,     			'u' ,										//	'i' , 
                "ू",     				'uu' ,										//	'iː' ,  
                'े' ,      			'λ' ,										//	'u' ,
                'ै'  ,     			'Δ' ,										//	'uː' ,
                'ो' ,      			'o' ,										//	'ɹ̩' ,        
                "ौ",      			"å" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                
                 
                //Hindi numbers
                
                 
                '१' ,      			'1' ,										 
                '२' ,      			'2' ,										   
                '३' ,      			'3' ,										 
                '४' ,      			'4' ,										  
                '५' ,      			'5' ,										 
                '६' ,      			'6' ,										 
                '७' ,      			'7' ,										  
                '८' ,      			'8' ,										 
                '९' ,      			'9' ,										  
                '१०' ,      			'10' ,										  
                
                
                
                
                'अ' 	,  				'a' ,										//	'ə' , 
                'आ' 	,  				'ā' ,										//	'ɑː' , 
                'इ' 	,  				'e' ,										//	'i' , 
                'ई' 	,  				'ee' ,										//	'iː' , 
                'उ' 	,  				'u' ,										//	'u' , 
                'ऊ' 	,  				'uu' ,										//	'uː' , 
                'ए' 	,  				'λ' ,										//	'eː' , 
                'ऐ' 	,  				'Δ' ,										//	'aːi' , 
                'ओ' 	,  				'o' ,										//	'oː' , 
                'औ' 	,  				'å' ,										//	'aːu' , 
                    
                'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'l' ,										//	'l̩' , 
                'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                    
                'अं' 	,  				'am' ,										//	'ⁿ' , 
                'अः' 	,  				'ahā' 										//	'h' 
                );
            break; 

            case "Kashmiri(Future)" :
            array_one = new Array(  
                     
                'क' 	,  				'k' ,										//	'kə' , 
                'ख' 	, 				'k-h' ,										//	'kʰə' , 
                'ग' 	,  				'g' ,										//	'gə' , 
                'घ' 	,  				'g-h' ,										//	'gʰə' , 
                'ङ' 	,  				'd' ,										//	'ŋə' , 
                'च' 	, 				'c' ,										//	'cə' , 
                'च़' 	, 				'č' ,										//	'cə' , 
                'छ' 	,  				'č-h' ,										//	'cʰə' , 
                'ज' 	, 				'j' ,										//	'ɟə' , 
                'ज़' 	,  				'ɉ' ,										//	'zə' , 
                'झ' 	,  				'z' ,										//	'ɟʰə' , 
                'ञ' 	,  				'n-g' ,										//	'ɲə' , 
                'ट' 	, 				't' ,										//	'ʈə' , 
                'ठ' 	,  				't-h' ,										//	'ʈʰə' , 
                'ड' 	, 				'd' ,										//	'ɖə' , 
                'ढ' 	, 				'd-h' ,										//	'ɖʰə' , 
                'ण' 	, 				'л' ,										//	'ɳə' , 
                'त' 	,  				'ŧ' ,										//	't̪ə' , 
                'थ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
                'द' 	,  				'đ' ,										//	'd̪ə' , 
                'ध' 	, 				'đ-h' ,										//	'd̪ʰə' , 
                'न' 	, 				'n' ,										// 	'nə' , 
                'प' 	,  				'p' ,										//	'pə' , 
                'फ' 	, 				'p-h' ,										//	'pʰə' , 
                'ब' 	,  				'b' ,										//	'bə' , 
                'भ' 	, 				'b-h' ,										//	'bʰə' , 
                'म' 	,  				'm' ,										//	'mə' , 
                'य' 	,  				'y' ,										//	'jə' , 
                'र' 	,  				'r' ,										//	'rə' , 
                'ल' 	, 				'l' ,										//	'lə' , 
                'व' 	,  				'w' ,										//	'və' , 
                'श' 	,  				's-h' ,										//	'ɕə' , 
                'ष' 	,  				's-h',										//	'ʂə' , 
                'स' 	,  				's' ,										//	'sə' , 
                'ह' 	,  				'h' ,										//	'ɦə' , 
                'क्ष' 	,  				'k-s-h' ,										//	'kʃə' , 
                'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
                'ज्ञ' 	,  				'd-n-y' ,										//	'gjə' , 
                'श्र' 	,  				's-h-r' ,										//	'ɕcə' , 
                'क़' 	,  				'k' ,										//	'qə' , 
                'ख़' 	,  				'k-h' ,										//	'xə' , 
                'ग़' 	,  				'g' ,										//	'ɣə' , 
                'फ़' 	,  				'f' ,										//	'fə' , 
                'ड़' 	,  				'd' ,										//	'ɽə' , 
                'ड़'	,  				'd' ,										//	'ɽə' , 
                'ढ़' 	,  				'd-h' ,										//	'ɽʱə' , 
                'ढ़'	,  				'd-h' ,										//	'ɽʱə' ,
                'ळ'	,  				'φ' ,	
                
                '्' ,  				'ø' ,										//	''  ,     // blank
                '़' ,      			'' ,	                                   	//	nukta
                
                'ø' ,      		'-' ,										//Combine letter
                
                "ा",     			'ā' ,										//	'ɑː' ,     
                'ि' ,     			'e' ,										//	'i' , 
                "ी",     			'ee' ,										//	'iː' ,  
                'ु' ,      			'u' ,										//	'u' ,
                'ू'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                "े",      			"λ" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                "ो",     			'o' ,										//	'oː' , 
                "ौ",     			'å' ,										//	'aːu' ,
                'ं' ,      			'an' ,										//	'ⁿ' ,
                'ँ' ,      			'om' ,										//	'ⁿ' ,
                'ं' ,        			'an' ,										//	'ⁿ' ,
                'ँ' ,        			'am' ,										//	'ⁿ' ,
                'ः' ,      			'aha' ,										//	'h' , 
                'ॉ' ,      			'ö' ,	
                
                
                //Marathi Numbers
                
                                                          
                '१' ,      			'1' ,										 
                '२' ,      			'2' ,										   
                '३' ,      			'3' ,										 
                '४' ,      			'4' ,										  
                '५' ,      			'5' ,										 
                '६' ,      			'6' ,										 
                '७' ,      			'7' ,										  
                '८' ,      			'8' ,										 
                '९' ,      			'9' ,										  
                '१०' ,      			'10' ,										  
                
                                                     
                
                'अ' 	,  				'a' ,										//	'ə' , 
                'आ' 	,  				'ā' ,										//	'ɑː' , 
                'इ' 	,  				'e' ,										//	'i' , 
                'ई' 	,  				'ee' ,										//	'iː' , 
                'उ' 	,  				'u' ,										//	'u' , 
                'ऊ' 	,  				'uu' ,										//	'uː' , 
                'ए' 	,  				'λ' ,										//	'eː' , 
                'ऐ' 	,  				'Δ' ,										//	'aːi' , 
                'ओ' 	,  				'o' ,										//	'oː' , 
                'औ' 	,  				'å' ,										//	'aːu' , 
                    
                'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'l' ,										//	'l̩' , 
                'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                    
                'अं' 	,  				'am' ,										//	'ⁿ' , 
                'अः' 	,  				'ahā' 										//	'h' 
                
                );
            break; 
            case "Santali(Future)" :
            array_one = new Array(  
					 
                // Santali Vowels
                
                'ᱚ' ,  				'a' ,										//	'kə' , 
                'ᱟ' , 				'ā' ,										//	'kʰə' , 
                'ᱟᱹ' ,  			'ā' ,										//	'gə' , 
                'ᱤ' ,  				'e',										//	'gʰə' , 
                'ᱩ' ,  				'u' ,										//	'ŋə' , 
                'ᱮ' , 				'ee' ,										//	'cə' , 
                'ᱳ' , 				'o' ,										//	'cə' , 
                
                 // Santali Consonats
                
                'ᱠ' ,  				'k' ,										//	'cʰə' , 
                'ᱜ' , 				'g' ,										//	'ɟə' , 
                'ᱣ' ,  				'n' ,										//	'zə' , 
                'ᱪ' ,  				'č' ,										//	'ɟʰə' , 
                'ᱡ' ,  				'j' ,										//	'ɲə' , 
                'ᱧ' , 				'л' ,										//	'ʈə' , 
                'ᱴ' ,  				't' ,										//	'ʈʰə' , 
                'ᱰ' , 				'd' ,										//	'ɖə' , 
                'ᱲ' , 				'r' ,										//	'ɖʰə' , 
                'ᱬ' , 				'л' ,										//	'ɳə' , 
                'ᱛ' ,  			'ŧ' ,										//	't̪ə' , 
                'ᱫ' ,  			'đ' ,										//	't̪ʰə' , 
                'ᱱ' ,  				'n' ,										//	'd̪ə' , 
                'ᱯ' , 				'p' ,										//	'd̪ʰə' , 
                'ᱵ' , 				'b' ,										// 	'nə' , 
                'ᱢ' ,  				'm' ,										//	'pə' , 
                'ᱭ' , 				'y' ,										//	'pʰə' , 
                'ᱨ' ,  				'r' ,										//	'bə' , 
                'ᱞ' , 				'l' ,										//	'bʰə' , 
                'ᱣ' ,  				'w' ,										//	'mə' , 
                'ᱥ' ,  				's' ,										//	'jə' , 
                'ᱦ' ,  			'h' ,										//	'rə' , 
                'ᱷ' , 				'h' ,										//	'lə' , 
                'ᱽ' ,  				'?' ,										//	'və' , 
                'ᱝ' ,  				'm' ,										//	'ɕə' , 
                'ᱸ' ,  				'm̐',										//	'ʂə' , 
                
                
                
                '्' ,  				'ø' ,										//	''  ,     // blank
                '़' ,      			'' ,	                                   	//	nukta
                
                'ø' ,      		'-' ,										//Combine letter
                
                "ा",     			'ā' ,										//	'ɑː' ,     
                'ि' ,     			'e' ,										//	'i' , 
                "ी",     			'ee' ,										//	'iː' ,  
                'ु' ,      			'u' ,										//	'u' ,
                'ू'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                "े",      			"λ" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                "ो",     			'o' ,										//	'oː' , 
                "ौ",     			'å' ,										//	'aːu' ,
                'ं' ,      			'an' ,										//	'ⁿ' ,
                'ँ' ,      			'om' ,										//	'ⁿ' ,
                'ं' ,        			'an' ,										//	'ⁿ' ,
                'ँ' ,        			'am' ,										//	'ⁿ' ,
                'ः' ,      			'aha' ,										//	'h' , 
                'ॉ' ,      			'ö' ,	
                
                
                //Santali Numbers
                
                                                          
                "mit'",      		'1' ,										 
                'bar' ,      		'2' ,										   
                'pɛ' ,      		'3' ,										 
                'pon' ,      		'4' ,										  
                'mɔ̃ɽɛ̃' ,      		'5' ,										 
                'turui' ,      	'6' ,										 
                'eae' ,      		'7' ,										  
                'irəl ' ,      	'8' ,										 
                ' arɛ' ,      		'9' ,										  
                'gɛl' ,      		'10' ,	
               'isi' ,      		'20' ,	
               'sae' ,      		'100' ,	
                
                                                     
                
                'अ' 	,  				'a' ,										//	'ə' , 
                'आ' 	,  				'ā' ,										//	'ɑː' , 
                'इ' 	,  				'e' ,										//	'i' , 
                'ई' 	,  				'ee' ,										//	'iː' , 
                'उ' 	,  				'u' ,										//	'u' , 
                'ऊ' 	,  				'uu' ,										//	'uː' , 
                'ए' 	,  				'λ' ,										//	'eː' , 
                'ऐ' 	,  				'Δ' ,										//	'aːi' , 
                'ओ' 	,  				'o' ,										//	'oː' , 
                'औ' 	,  				'å' ,										//	'aːu' , 
                    
                'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'l' ,										//	'l̩' , 
                'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                    
                'अं' 	,  				'am' ,										//	'ⁿ' , 
                'अः' 	,  				'ahā' 										//	'h' 
                );
            break;           
            case "Tulu(Future)" :
            array_one = new Array(  

                'ಕ' 	,  				'k' ,										//	'kə' , 
                'ಖ' 	, 				'k-h' ,										//	'kʰə' , 
                'ಗ' 	,  				'g' ,										//	'gə' , 
                'ಘ' 	,  				'g-h' ,										//	'gʰə' , 
                'ಙ' 	,  				'd' ,										//	'ŋə' , 
                'ಚ' 	, 				'č' ,										//	'cə' , 
                'ಛ' 	,  				'č-h' ,										//	'cʰə' , 
                'ಜ' 	, 				'j' ,										//	'ɟə' , 
                'ಝ' 	,  				'ɉ' ,										//	'ɟʰə' , 
                'ಞ' 	,  				'nya' ,										//	'ɲə' , 
                'ಟ' 	, 				't' ,										//	'ʈə' , 
                'ಠ' 	,  				't-h' ,										//	'ʈʰə' , 
                'ಡ' 	, 				'd' ,										//	'ɖə' , 
                'ಢ' 	, 				'd-h' ,										//	'ɖʰə' , 
                'ಣ' 	, 				'л' ,										//	'ɳə' , 
                'ತ' 	,  				'ŧ' ,										//	't̪ə' , 
                'ಥ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
                'ದ' 	,  				'đ' ,										//	'd̪ə' , 
                'ಧ' 	, 				'đ-h' ,										//	'd̪ʰə' , 
                'ನ' 	, 				'n' ,										// 	'nə' , 
                'ಪ' 	,  				'p' ,										//	'pə' , 
                'ಫ' 	, 				'p-h' ,										//	'pʰə' , 
                'ಬ' 	,  				'b' ,										//	'bə' , 
                'ಭ' 	, 				'b-h' ,										//	'bʰə' , 
                'ಮ' 	,  				'm' ,										//	'mə' , 
                'ಯ' 	,  				'y' ,										//	'jə' , 
                'ರ' 	,  				'r' ,										//	'rə' , 
                'ಲ' 	, 				'l' ,										//	'lə' , 
                'ವ'	,  				'w' ,										//	'və' , 
                'ವ'	,  				'v' ,										//	'və' ,
                'ಶ' 	,  				's-h' ,										//	'ɕə' , 
                'ಷ' 	,  				's-h',										//	'ʂə' , 
                'ಸ' 	,  				's' ,										//	'sə' , 
                'ಹ' 	,  				'h' ,										//	'ɦə' , 
                'क्ष' 	,  				'k-s-h' ,										//	'kʃə' , 
                'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
                'ज्ञ' 	,  				'd-n-y' ,										//	'gjə' , 
                'श्र' 	,  				's-h-r' ,										//	'ɕcə' , 
                'क़' 	,  				'k' ,										//	'qə' , 
                'ख़' 	,  				'k-h' ,										//	'xə' , 
                'ग़' 	,  				'g' ,										//	'ɣə' , 
                'ज़' 	,  				'ɉ' ,										//	'zə' , 
                'फ़' 	,  				'f' ,										//	'fə' , 
                'ड़' 	,  				'd' ,										//	'ɽə' , 
                'ड़'	,  				'd' ,										//	'ɽə' , 
                'ढ़' 	,  				'd-h' ,										//	'ɽʱə' , 
                'ढ़'	,  				'd-h' ,										//	'ɽʱə' ,
                'ಳ'	,  				'φ' ,	
                
                '್' ,  				'ø' ,										//	''  ,     // blank
                '़' ,      			'' ,	                                   	//	nukta
                
                'ø' ,      		'-' ,										//Combine letter
                
                'ಾ',     			'ā' ,										//	'ɑː' ,     
                'ಿ' ,     			'e' ,										//	'i' , 
                'ೀ',     			'ee' ,										//	'iː' ,  
                'ು' ,      			'u' ,										//	'u' ,
                'ೂ'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                'ೆ',      			'λ' ,										//	'eː' , 
                'ೇ',      			'λ' ,										//	'aːi' ,
                'ೈ',      			'Δ' ,										//	'aːi' ,
                'ೊ',     			'o' ,										//	'oː' , 
                'ೋ',     			'oo' ,										//	'oː' , 
                'ೌ',     			'å' ,										//	'aːu' ,
                'ं' ,      			'an' ,										//	'ⁿ' ,
                'ँ' ,      			'om' ,										//	'ⁿ' ,
                'ं' ,        			'an' ,										//	'ⁿ' ,
                'ಂ' ,        		'-m' ,										//	'ⁿ' ,
                'ಃ' ,      			'aha' ,										//	'h' , 
                'ೖ' ,        		    'Δ' ,										//	kannada ai length mark ,
                'ೕ' ,        		    '?' ,										//	kannada length mark ,
                'ಏ' ,      			'ee' ,
                'ೃ' ,      			'r' ,
                
                
                // kannada Numbers
                
                '೦' ,      			'0' ,
                '೧' ,      			'1' ,
                '೨' ,      			'2' ,										   
                '೩' ,      			'3' ,										 
                '೪' ,      			'4' ,										  
                '೫' ,      			'5' ,										 
                '೬' ,      			'6' ,										 
                '೭' ,      			'7' ,										  
                '೮' ,      			'8' ,										 
                '೯' ,      			'9' ,										  
                '೧೦' ,      			'10' ,										  
                
                                                     
                
                'ಅ' 	,  				'a' ,										//	'ə' , 
                'ಆ' 	,  				'ā' ,										//	'ɑː' , 
                'ಇ' 	,  				'e' ,										//	'i' , 
                'ಈ' 	,  				'ee' ,										//	'iː' , 
                'ಉ' 	,  				'u' ,										//	'u' , 
                'ಊ' 	,  				'uu' ,										//	'uː' , 
                'ಎ' 	,  				'λ' ,										//	'eː' , 
                'ಐ' 	,  				'λ' ,										//	'aːi' , 
                'ಒ' 	,  				'o' ,										//	'oː' , 
                'ಔ' 	,  				'å' ,										//	'aːu' ,
                'ಏ ' 	,  				'λ' ,										//	'ə' ,  
                    
                'ಋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'l' ,										//	'l̩' , 
                'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                    
                'ಅಂ' 	,  				'am' ,										//	'ⁿ' , 
                'ಅಃ' 	,  				'ahā' 	,									//	'h' 
                'ಓ' 	,  				'ö'     
                );
            break;
            case "Bodo(Future)" :
            array_one = new Array(  
                     
                'क' 	,  				'k' ,										//	'kə' , 
                'ख' 	, 				'k-h' ,										//	'kʰə' , 
                'ग' 	,  				'g' ,										//	'gə' , 
                'घ' 	,  				'g-h' ,										//	'gʰə' , 
                'ङ' 	,  				'd' ,										//	'ŋə' , 
                'च' 	, 				'c' ,										//	'cə' , 
                'च़' 	, 				'č' ,										//	'cə' , 
                'छ' 	,  				'č-h' ,										//	'cʰə' , 
                'ज' 	, 				'j' ,										//	'ɟə' , 
                'ज़' 	,  				'ɉ' ,										//	'zə' , 
                'झ' 	,  				'z' ,										//	'ɟʰə' , 
                'ञ' 	,  				'n-g' ,										//	'ɲə' , 
                'ट' 	, 				't' ,										//	'ʈə' , 
                'ठ' 	,  				't-h' ,										//	'ʈʰə' , 
                'ड' 	, 				'd' ,										//	'ɖə' , 
                'ढ' 	, 				'd-h' ,										//	'ɖʰə' , 
                'ण' 	, 				'л' ,										//	'ɳə' , 
                'त' 	,  				'ŧ' ,										//	't̪ə' , 
                'थ' 	,  				'ŧ-h' ,										//	't̪ʰə' , 
                'द' 	,  				'đ' ,										//	'd̪ə' , 
                'ध' 	, 				'đ-h' ,										//	'd̪ʰə' , 
                'न' 	, 				'n' ,										// 	'nə' , 
                'प' 	,  				'p' ,										//	'pə' , 
                'फ' 	, 				'p-h' ,										//	'pʰə' , 
                'ब' 	,  				'b' ,										//	'bə' , 
                'भ' 	, 				'b-h' ,										//	'bʰə' , 
                'म' 	,  				'm' ,										//	'mə' , 
                'य' 	,  				'y' ,										//	'jə' , 
                'र' 	,  				'r' ,										//	'rə' , 
                'ल' 	, 				'l' ,										//	'lə' , 
                'व' 	,  				'w' ,										//	'və' , 
                'श' 	,  				's-h' ,										//	'ɕə' , 
                'ष' 	,  				's-h',										//	'ʂə' , 
                'स' 	,  				's' ,										//	'sə' , 
                'ह' 	,  				'h' ,										//	'ɦə' , 
                'क्ष' 	,  				'k-s-h' ,										//	'kʃə' , 
                'त्र' 	,  				'ŧ-r' ,										//	't̪ɾə' , 
                'ज्ञ' 	,  				'd-n-y' ,										//	'gjə' , 
                'श्र' 	,  				's-h-r' ,										//	'ɕcə' , 
                'क़' 	,  				'k' ,										//	'qə' , 
                'ख़' 	,  				'k-h' ,										//	'xə' , 
                'ग़' 	,  				'g' ,										//	'ɣə' , 
                'फ़' 	,  				'f' ,										//	'fə' , 
                'ड़' 	,  				'd' ,										//	'ɽə' , 
                'ड़'	,  				'd' ,										//	'ɽə' , 
                'ढ़' 	,  				'd-h' ,										//	'ɽʱə' , 
                'ढ़'	,  				'd-h' ,										//	'ɽʱə' ,
                'ळ'	,  				'φ' ,	
                
                '्' ,  				'ø' ,										//	''  ,     // blank
                '़' ,      			'' ,	                                   	//	nukta
                
                'ø' ,      		'-' ,										//Combine letter
                
                "ा",     			'ā' ,										//	'ɑː' ,     
                'ि' ,     			'e' ,										//	'i' , 
                "ी",     			'ee' ,										//	'iː' ,  
                'ु' ,      			'u' ,										//	'u' ,
                'ू'  ,     			'uu' ,										//	'uː' ,
                'ृ' ,      			'u' ,										//	'ɹ̩' ,        
                "े",      			"λ" ,										//	'eː' , 
                "ै",      			"Δ" ,										//	'aːi' ,
                "ो",     			'o' ,										//	'oː' , 
                "ौ",     			'å' ,										//	'aːu' ,
                'ं' ,      			'an' ,										//	'ⁿ' ,
                'ँ' ,      			'om' ,										//	'ⁿ' ,
                'ं' ,        			'an' ,										//	'ⁿ' ,
                'ँ' ,        			'am' ,										//	'ⁿ' ,
                'ः' ,      			'aha' ,										//	'h' , 
                'ॉ' ,      			'ö' ,	
                
                
                //Marathi Numbers
                
                                                          
                '१' ,      			'1' ,										 
                '२' ,      			'2' ,										   
                '३' ,      			'3' ,										 
                '४' ,      			'4' ,										  
                '५' ,      			'5' ,										 
                '६' ,      			'6' ,										 
                '७' ,      			'7' ,										  
                '८' ,      			'8' ,										 
                '९' ,      			'9' ,										  
                '१०' ,      			'10' ,										  
                
                                                     
                
                'अ' 	,  				'a' ,										//	'ə' , 
                'आ' 	,  				'ā' ,										//	'ɑː' , 
                'इ' 	,  				'e' ,										//	'i' , 
                'ई' 	,  				'ee' ,										//	'iː' , 
                'उ' 	,  				'u' ,										//	'u' , 
                'ऊ' 	,  				'uu' ,										//	'uː' , 
                'ए' 	,  				'λ' ,										//	'eː' , 
                'ऐ' 	,  				'Δ' ,										//	'aːi' , 
                'ओ' 	,  				'o' ,										//	'oː' , 
                'औ' 	,  				'å' ,										//	'aːu' , 
                    
                'ऋ' 	,  				'ru' ,										//	'ɹ̩' , 
                'ॠ' 	,  				'ruu' ,										//	'ɹ̩ː' , 
                'ऌ' 	,  				'l' ,										//	'l̩' , 
                'ॡ' 	,  				'lu' ,										//	'l̩ː' , 
                    
                'अं' 	,  				'am' ,										//	'ⁿ' , 
                'अः' 	,  				'ahā' 										//	'h' 
                );
            break;
            case "Gujarati(Beta)" :
            array_one = new Array(  

                // Gujrati Vowels
                
                'અ' 	,  				'a' ,										//	'kə' , 
                'આ' 	, 				'ā' ,										//	'kʰə' , 
                'ઇ' 	,  				'e' ,										//	'gə' , 
                'ઈ' 	,  				'ee' ,										//	'gʰə' , 
                'ઉ' 	,  				'u' ,										//	'ŋə' , 
                'ઊ' 	, 				'uu' ,										//	'cə' , 
                'ઐ' 	,  				'Δ' ,										//	'cʰə' , 
                'એ' 	, 				'λ' ,										//	'ɟə' , 
                'અં' 	,  				'ŋ' ,										//	'ɟʰə' , 
                'ઓ' 	,  				'o' ,										//	'ɲə' , 
                'ઔ' 	, 				'å' ,										//	'ʈə' , 
                'અઃ' 	, 				'a-ha' ,									//	'ʈə' , 
                
                // Gujrati Consonants
                
                'ક' 	,  				'k' ,										//	'ʈʰə' , 
                'ખ' 	, 				'k-h' ,										//	'ɖə' , 
                'ગ' 	, 				'g' ,										//	'ɖʰə' , 
                'ઘ' 	, 				'g-h' ,										//	'ɳə' , 
                'ચ' 	,  				'c' ,										//	't̪ə' , 
                'છ' 	,  				'c-h' ,										//	't̪ʰə' , 
                'જ' 	,  				'j' ,										//	'd̪ə' , 
                'ઝ' 	, 				'z' ,										//	'd̪ʰə' , 
                'ટ' 	, 				't' ,										// 	'nə' , 
                'ઠ' 	,  				't-h' ,										//	'pə' , 
                'ડ' 	, 				'd' ,										//	'pʰə' , 
                'ઢ' 	,  				'đ-h' ,										//	'bə' , 
                'ણ' 	, 				'л' ,										//	'bʰə' , 
                'ત' 	,  				'ŧ' ,										//	'mə' , 
                'થ' 	,  				'ŧ-h' ,										//	'jə' , 
                'દ' 	,  				'đ' ,										//	'rə' , 
                'ધ' 	, 				'd-h' ,										//	'lə' , 
                'ન' 	,  				'n' ,										//	'və' , 
                'પ' 	,  				'p' ,										//	'ɕə' , 
                'ફ' 	,  				'f',										//	'ʂə' , 
                'બ' 	,  				'b' ,										//	'sə' , 
                'ભ' 	,  				'b-h' ,										//	'ɦə' , 
                'મ' 	,  				'm' ,										//	'kʃə' , 
                'ય' 	,  				'y' ,										//	't̪ɾə' , 
                'ર' 	,  				'r' ,										//	'gjə' , 
                'લ' 	,  				'l' ,										//	'ɕcə' , 
                'વ' 	,  				'w' ,										//	'qə' , 
                'શ' 	,  				's-h' ,										//	'xə' , 
                'સ' 	,  				's' ,										//	'ɣə' , 
                'ષ' 	,  				's-h' ,										//	'zə' , 
                'હ' 	,  				'h' ,										//	'fə' , 
                'ળ' 	,  				'l' ,										//	'ɽə' , 
                'ક્ષ'	,  				'k-s-h' ,										//	'ɽə' , 
                'જ્ઞ' 	,  				'd-n-y' ,										//	'ɽʱə' , 
                
                 
                // Special Charachter
                 
                 
                'ા' ,  				'ā' ,										//	''  ,     
                'િ' ,      			'e' ,	                                   	//	nukta,
                'ી' ,      		    'ee' ,										//Combine letter,
                "ુ",     			    'u' ,										//	'ɑː' ,    
                'ૂ' ,     			'uu' ,										//	'i' , 
                "ૈ",     			    'Δ' ,										//	'iː' ,  
                'ે' ,      			'λ' ,										//	'u' ,
                'ો'  ,     			'o' ,										//	'uː' ,
                'ૌ' ,      			'å' ,										//	'ɹ̩' ,        
                "ં",      			"ŋ" ,										//	'eː' , 
                'ઃ' ,  				'a-ha' ,										//	''  ,     
                'ૃ' ,  				'ru' ,										//	''  ,   
                'ૅ' ,  				'λ' ,										  
                'ૉ' ,  				'o' ,										  
                '્' ,  				'-' ,										//	gujarati sign virama	 ,  
                 
                
                // Gujrati Numbers
                 
                '૧' ,  				'1' ,										//	Gujrati digit one  ,
                '૨' ,  				'2' ,										//	Gujrati digit two  ,
                '૩' ,  				'3' ,										//	Gujrati digit Three  ,
                '૪' ,  				'4' ,										//	Gujrati digit Four  ,
                '૫' ,  				'5' ,										//	Gujrati digit Five  ,
                '૬' ,  				'6' ,										//	Gujrati digit Six  ,
                '૭' ,  				'7' ,										//	Gujrati digit Seven  ,
                '૮' ,  				'8' ,										//	Gujrati digit Eight  ,
                '૯' ,  				'9' ,										//	Gujrati digit Nine  ,
                '૧૦' ,  				'10' 										//	Gujrati digit Ten  ,     
                );
            break;
            case "Manipuri(Future)" :
            array_one = new Array(  

                // Manipuri Vowels
                
                'অ' 	,  				'ö' ,					//	'kö' , 
                'আ' 	, 				'ā' ,					//	'kʰə' , 
                'ই' 	,  				'e' ,					//	'gə' , 
                'ঈ' 	,  				'ee' ,					//	'gʰə' , 
                'উ' 	,  				'u' ,					//	'ŋə' , 
                'ঊ' 	, 				'uu' ,					//	'cə' , 
                'ঋ' 	,  				'Δ' ,					//	'cʰə' , 
                'এ' 	, 				'λ' ,					//	'ɟə' , 
                'ঐ' 	,  				'Δ' ,					//	'ɟʰə' , 
                'ও' 	,  				'o' ,					//	'ɲə' ,   ছন্দপতন
                'ঔ' 	, 				'å' ,					//	'ʈə' , 
                
                // Manipuri Consonants
                                                    
                'ক' 	,  				'k' ,					//	'ʈʰə' ,   
                'খ' 	, 				'k-h' ,					//	'ɖə' , 
                'গ' 	, 				'g' ,					//	'ɖʰə' , 
                'ঘ' 	, 				'g-h' ,					//	'ɳə' , 
                'ঙ' 	,  				'n' ,					//	't̪ə' , 
                'চ' 	,  				'č' ,					//	't̪ʰə' , 
                'ছ' 	,  				'c-h' ,					//	'd̪ə' , 
                'জ' 	, 				'ɉ' ,					//	'd̪ʰə' , 
                'ঝ' 	, 				'j' ,					// 	'nə' , 
                'ঞ' 	,  				'n' ,					//	'pə' , 
                'ট' 	, 				't' ,					//	'pʰə' , 
                'ঠ' 	,  				't-h' ,					//	'bə' , 
                'ড' 	, 				'd' ,					//	'bʰə' , 
                'ঢ' 	,  				'd-h' ,					//	'mə' , 
                'ণ' 	,  				'л' ,					//	'jə' , 
                'ত' 	,  				'ŧ' ,					//	'rə' , 
                'থ' 	, 				'ŧ-h' ,					//	'lə' , 
                'দ' 	,  				'đ' ,					//	'və' , 
                'ধ' 	,  				'đ-h' ,					//	'ɕə' , 
                'ন' 	,  				'n',				    //	'ʂə' , 
                'প' 	,  				'p' ,					//	'sə' , 
                'ফ' 	,  				'f' ,					//	'ɦə' , 
                'ব' 	,  				'b' ,					//	'kʃə' , 
                'ভ' 	,  				'b-h' ,					//	't̪ɾə' , 
                'ম' 	,  				'm' ,					//	'gjə' , 
                'য' 	,  				'ya' ,					//	'ɕcə' , 
                'র' 	,  				'r' ,					//	'qə' , 
                'ল' 	,  				'l' ,					//	'xə' , 
                'শ' 	,  				's-h' ,					//	'ɣə' , 
                'ষ' 	,  				's-h' ,					//	'zə' , 
                'স' 	,  				's-h' ,					//	'fə' , 
                'হ' 	,  				'h' ,					//	'ɽə' , 
                'য়'	,  				'y' ,					//	'ɽə' , 
                'ড়' 	,  				'?' ,					//	'ɽʱə' , 
                'ঢ়'	,  				'?' ,					//	'ɽʱə' ,
                 
                // Special Charachter
                 
                 
                'া' ,  				'ā' ,					//	''  ,     
                'ি' ,      			'e' ,	                //	nukta,
                'ী' ,      		    'ee' ,					//Combine letter,
                "ু",     			'u' ,					//	'ɑː' ,    
                'ূ' ,     			'uu' ,					//	'i' , 
                "ৃ",     			'ø-r' ,					//	'iː' ,  
                'ে' ,      			'λ' ,					//	'u' ,
                'ৈ'  ,     			'Δ' ,					//	'uː' ,
                'ো' ,      			'o' ,					//	'ɹ̩' ,        
                "ৌ",      			"å" ,					//	'eː' , 
                'া' ,  				'ā' ,					//	''  ,     
                'ং' ,  				'am' ,					//	''  , 
                '।'  ,				'.'  ,					// devanagari danda		 , 
                '্' ,  				'-' ,					//	bengali sign virama  ,  
                '়' ,  				'?' ,					//	bengali sign nukta  ,  
                'ৎ' ,  				'?' ,					//	bengali letter khanda ta  ,
                'ঁ' ,  				'?' ,					//	bengali sign candrabindu,   e.g=পাঁচ     
                
                
                
                '০' ,  				'0' ,					//	bengali digit zero  ,
                '১' ,  				'1' ,					//	bengali digit one  ,
                '২' ,  				'2' ,					//	bengali digit two  ,
                '৩' ,  				'3' ,					//	bengali digit Three  ,
                '৪' ,  				'4' ,					//	bengali digit Four  ,
                '৫' ,  				'5' ,					//	bengali digit Five  ,
                '৬' ,  				'6' ,					//	bengali digit Six  ,
                '৭' ,  				'7' ,					//	bengali digit Seven  ,
                '৮' ,  				'8' ,					//	bengali digit Eight  ,
                '৯' ,  				'9' ,					//	bengali digit Nine  ,
                '১০' ,  			'10' 					//	bengali digit Ten  ,
            );
            break;
            case "Urdu(Future)" :
            array_one = new Array(  

                // Urdu Consonants
                
                'ب' ,  				'k-h' ,										//	'ख' , 
                'ت' , 				'ŧ' ,										//	'त' , 
                'ث' ,  				'ŧ' ,										//	'त'  , 
                'ج' ,  				'g' ,										//	'ग'  پ, 
                'ح' ,  				'j' ,										//	'ज' , 
                'خ' , 				'k-h' ,										//	'ख' , 
                'د' ,  				'g-h' ,										//	'घ' , 
                'ذ' , 				'ɉ' ,										//	'ज़' , 
                'ر' ,  				'ār' ,										//	'आर' , 
                'ز' ,  				'jee' ,										//	'जी' , 
                'س' , 				'sa' ,										//	'स' , 
                'ش' ,  				's-he' ,									//	'शि' , 
                'ص' , 				'p-he' ,									//	'पी' , 
                'ض' , 				'đ' ,										//	'đ??', 
                'ط' , 				'am' ,										//	'ँ??' , 
                'ظ' ,  				't-h' ,										//	'ठ' , 
                'ع' ,  				'a' ,										//	'अ' , 
                'غ' ,  				'g-h' ,										//	'दाग??' , 
                'ف' , 				'f' ,										//	'एफ़??' , 
                'ق' , 				'k-yu' ,									// 	'क्यू' , 
                'ل' ,  				'lā' ,										//	'लिमिटेड??' , 
                'م' , 				'm' ,										//	'म' , 
                'ن' ,  				'n' ,										//	'एन' , 
                'ه' , 				'h' ,										//	'ह' , 
                'و',  				'wā' ,										//	'और??' ,
                'ي' ,  				'yā' ,										//     'ए.आर.??' ,
                
                //Urdu Vowels
                
                'ا' , 				'a' ,										//	'अ' , 
                'آ' ,  				'ā' ,										//	'आ' , 
                'ی' ,  				'e' ,										//	't͡ʃ' , 																																																																																																																																																																																																																																																																																																																																																
                ' ُ' ,  				'u' ,										//	'k' , 														
                'و' ,  				'uu' ,										//	'k' , 																																																																																																			
                  
                'ٹ' ,  				'tλ' ,                                   // 	arabic letter tteh
                'ک' ,  				'k' ,                                    // 	arabic letter keheh
                'ئ' ,  				'?' ,                                     // 	arabic letter yeh with hamza above
                'ڈ' ,  				'dλ' ,                                   // 	arabic letter ddal
                'آ' ,  				'?' ,                                     // 	arabic letter alef with madda above
                'پ' ,  				'p' ,                                     // 	arabic letter peh
                'ے' ,  				'?' ,                                     // 	arabic letter yeh barree
                'ہ' ,  				'h' ,                                     // 	arabic letter heh goal	
                'گ' ,  				'?' ,                                     // 	arabic letter gaf	
                'ھ' ,  				'?' ,                                     // 	arabic letter heh doachashmee	
                'ں' ,  				'n' ,                                     // 	arabic letter noon ghunna
                'ھ' ,  				'?' ,                                     // 	arabic letter waw with hamza above
                'ذ' ,  				'?' ,                                     // 	arabic letter thal
                'چ' ,  				'?' ,                                     // 	arabic letter tcheh
                'ﺅ' ,  				'?' ,                                     // 	arabic letter waw with hamza above isolated form
                
                // Kana,matra velanti etc 
                
                'ਾ' ,  				'ā' ,
                'ਿ' ,  				'e' ,
                'ੀ' ,  				'ee' ,
                'ੁ' ,  				'u' ,
                'ੂ' ,  				'uu' ,
                'ੇ' ,  				'λ' ,
                'ੈ' ,  				'Δ' ,
                'ੋ' ,  				'o' ,
                'ੌ' ,  				'å' , 
                'ਂ' ,  				'ø-n' ,
                'ੰ' ,  				'ø-n' , 
                'ੱ' ,  				'?' ,                               
                 
                '਼' ,  				'?' , 							// 	gurmukhi sign nukta
                '੍' ,  				'?' , 							//  gurmukhi sign virama	
                
                // Urdu Numbers
                
                '۰' ,      			'0' ,
                '۱' ,      			'1' ,
                '۲' ,      			'2' ,										   
                '۳' ,      			'3' ,										 
                '۴' ,      			'4' ,										  
                '۵' ,      			'5' ,										 
                '۶' ,      			'6' ,										 
                '۷' ,      			'7' ,										  
                '۸' ,      			'8' ,										 
                '۹' ,      			'9' ,										  
                '۱۰' ,      		'10' 
                );
            break;
            case "Punjabi(Alpha)" :
            array_one = new Array(  

                // Punjabi Consonants
                'ੲ' 	,  				'e' ,										//	'a' , 
                'ਸ' 	, 				's' ,										//	'a' , 
                'ਹ' 	,  				'h' ,										//	'aː' , 
                'ਕ' 	,  				'k' ,										//	'aː' , 
                'ਖ' 	,  				'k-h' ,										//	'i' , 
                'ਗ' 	, 				'g' ,										//	'i' , 
                'ਘ' 	,  				'g-h' ,										//	'iː' , 
                'ਙ' 	, 				'n' ,										//	'iː' , 
                'ਚ' 	,  				'c' ,										//	'u' , 
                'ਛ' 	,  				'č' ,										//	'u' , 
                'ਜ' 	, 				'j' ,										//	'ɯ' , 
                'ਝ' 	,  				'c' ,										//	'uː' , 
                'ਞ' 	, 				'?' ,										//	'uː' , 
                'ਟ' 	, 				't' ,										//	'e' , 
                'ਠ' , 				't-h' ,										//	'e' , 
                'ਡ' 	,  				'd' ,										//	'eː' , 
                'ਢ' 	,  				't' ,										//	'eː' , 
                'ਣ' 	,  				'n' ,										//	'aɪ̯' , 
                'ਤ' , 				'ŧ' ,										//	'aɪ̯' , 
                'ਥ' 	, 				'ŧ-h' ,										// 	'o' , 
                'ਦ' ,  				'đ' ,										//	'o' , 
                'ਧ' 	, 				'ŧ' ,										//	'oː' , 
                'ਨ' ,  				'n' ,										//	'oː' , 
                'ਪ' , 				'p' ,										//	'aʊ̯' , 
                'ਫ',  				'f' ,										//	'aʊ̯' ,
                
                'ਬ' ,  				'b' ,
                'ਭ' ,  				'p' ,
                'ਮ' ,  				'm' ,
                'ਯ' ,  				'y' ,
                'ਰ' ,  				'r' ,
                'ਲ' ,  				'l' ,
                'ਵ' ,  				'w' ,
                'ੜ' ,  				'd' ,
                'ਸ਼' ,  				's-h' ,
                'ਖ਼' ,  				'h' ,
                'ਗ਼' ,  				'g' ,
                'ਜ਼' ,  				'z' ,
                'ਫ਼' ,  				'p-h' ,
                'ਲ਼' ,  				'l' ,
                
                //Punjabi Vowels
                
                'ਅ' 	,  				'a' ,										//	'k' , 
                'ਆ' 	,  				'ā' ,										//	'k' , 
                'ਇ' 	, 				'e' ,										//	'h' , 
                'ਈ' 	,  				'ee' ,										//	'ŋ' , 
                'ਉ' 	,  				'u' ,										//	't͡ʃ' , 
                'ਊ' ,  				'uu',										//	'd͡ʑ' , 
                'ਏ' 	,  				'e' ,										//	's' , 
                'ਐ' 	,  				'Δ' ,										//	'ɲ' , 
                'ਓ' 	,  				'o' ,									    //	'ʈ' , 
                'ਔ' 	,  				'å' ,										//	'ɖ' , 
                
                // Kana,matra velanti etc 
                
                'ਾ' ,  				'ā' ,
                'ਿ' ,  				'e' ,
                'ੀ' ,  				'ee' ,
                'ੁ' ,  				'u' ,
                'ੂ' ,  				'uu' ,
                'ੇ' ,  				'λ' ,
                'ੈ' ,  				'Δ' ,
                'ੋ' ,  				'o' ,
                'ੌ' ,  				'å' , 
                'ਂ' ,  				'ø-n' ,
                'ੰ' ,  				'ø-n' , 
                'ੱ' ,  				'?' ,                               
                 
                '਼' ,  				'?' , 
                '੍' ,  				'?' , 							//  gurmukhi sign virama	
                
                
                // Punjabi Numbers
                
                '੦' ,      			'0' ,
                '੧' ,      			'1' ,
                '੨' ,      			'2' ,										   
                '੩' ,      			'3' ,										 
                '੪' ,      			'4' ,										  
                '੫' ,      			'5' ,										 
                '੬' ,      			'6' ,										 
                '੭' ,      			'7' ,										  
                '੮' ,      			'8' ,										 
                '੯' ,      			'9' ,										  
                '੧੦' ,      			'10' 
                );
            break;
            
            case "Spanish(Alpha)" :
            array_one = new Array(  

                        //Spanish numbers

                        '1' ,      			'1' ,										 
                        '2' ,      			'2' ,										   
                        '3' ,      			'3' ,										 
                        '4' ,      			'4' ,										  
                        '5' ,      			'5' ,										 
                        '6' ,      			'6' ,										 
                        '7' ,      			'7' ,										  
                        '8' ,      			'8' ,										 
                        '9' ,      			'9' ,										  
                        '10' ,      		'10' 
                );
            break;

    }
}